Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
extern volatile __IPC21bits_t IPC21bits __asm__ ("IPC21") __attribute__((section("sfrs"), address(0xBF810290)));
extern volatile uint32_t        IPC21CLR __attribute__((section("sfrs"),address(0xBF810294)));
extern volatile uint32_t        IPC21SET __attribute__((section("sfrs"),address(0xBF810298)));
extern volatile uint32_t        IPC21INV __attribute__((section("sfrs"),address(0xBF81029C)));
#define IPC22 IPC22
extern volatile uint32_t   IPC22 __attribute__((section("sfrs"), address(0xBF8102A0)));
typedef union {
  struct {
    uint32_t T9IS:2;
    uint32_t T9IP:3;
    uint32_t :3;
    uint32_t IC9EIS:2;
    uint32_t IC9EIP:3;
    uint32_t :3;
    uint32_t IC9IS:2;
    uint32_t IC9IP:3;
    uint32_t :3;
    uint32_t OC9IS:2;
    uint32_t OC9IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC22bits_t;
extern volatile __IPC22bits_t IPC22bits __asm__ ("IPC22") __attribute__((section("sfrs"), address(0xBF8102A0)));
extern volatile uint32_t        IPC22CLR __attribute__((section("sfrs"),address(0xBF8102A4)));
extern volatile uint32_t        IPC22SET __attribute__((section("sfrs"),address(0xBF8102A8)));
extern volatile uint32_t        IPC22INV __attribute__((section("sfrs"),address(0xBF8102AC)));
#define IPC23 IPC23
extern volatile uint32_t   IPC23 __attribute__((section("sfrs"), address(0xBF8102B0)));
typedef union {
  struct {
    uint32_t AD1IS:2;
    uint32_t AD1IP:3;
    uint32_t :11;
    uint32_t AD1DC1IS:2;
    uint32_t AD1DC1IP:3;
    uint32_t :3;
    uint32_t AD1DC2IS:2;
    uint32_t AD1DC2IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC23bits_t;
extern volatile __IPC23bits_t IPC23bits __asm__ ("IPC23") __attribute__((section("sfrs"), address(0xBF8102B0)));
extern volatile uint32_t        IPC23CLR __attribute__((section("sfrs"),address(0xBF8102B4)));
extern volatile uint32_t        IPC23SET __attribute__((section("sfrs"),address(0xBF8102B8)));
extern volatile uint32_t        IPC23INV __attribute__((section("sfrs"),address(0xBF8102BC)));
#define IPC24 IPC24
extern volatile uint32_t   IPC24 __attribute__((section("sfrs"), address(0xBF8102C0)));
typedef union {
  struct {
    uint32_t AD1DF1IS:2;
    uint32_t AD1DF1IP:3;
    uint32_t :3;
    uint32_t AD1DF2IS:2;
    uint32_t AD1DF2IP:3;
    uint32_t :3;
    uint32_t AD1DF3IS:2;
    uint32_t AD1DF3IP:3;
    uint32_t :3;
    uint32_t AD1DF4IS:2;
    uint32_t AD1DF4IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC24bits_t;
extern volatile __IPC24bits_t IPC24bits __asm__ ("IPC24") __attribute__((section("sfrs"), address(0xBF8102C0)));
extern volatile uint32_t        IPC24CLR __attribute__((section("sfrs"),address(0xBF8102C4)));
extern volatile uint32_t        IPC24SET __attribute__((section("sfrs"),address(0xBF8102C8)));
extern volatile uint32_t        IPC24INV __attribute__((section("sfrs"),address(0xBF8102CC)));
#define IPC25 IPC25
extern volatile uint32_t   IPC25 __attribute__((section("sfrs"), address(0xBF8102D0)));
typedef union {
  struct {
    uint32_t AD1F1IS:2;
    uint32_t AD1F1IP:3;
    uint32_t :3;
    uint32_t AD1EOSIS:2;
    uint32_t AD1EOSIP:3;
    uint32_t :3;
    uint32_t AD1ARIS:2;
    uint32_t AD1ARIP:3;
    uint32_t :3;
    uint32_t AD1RSIS:2;
    uint32_t AD1RSIP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC25bits_t;
extern volatile __IPC25bits_t IPC25bits __asm__ ("IPC25") __attribute__((section("sfrs"), address(0xBF8102D0)));
extern volatile uint32_t        IPC25CLR __attribute__((section("sfrs"),address(0xBF8102D4)));
extern volatile uint32_t        IPC25SET __attribute__((section("sfrs"),address(0xBF8102D8)));
extern volatile uint32_t        IPC25INV __attribute__((section("sfrs"),address(0xBF8102DC)));
#define IPC26 IPC26
extern volatile uint32_t   IPC26 __attribute__((section("sfrs"), address(0xBF8102E0)));
typedef union {
  struct {
    uint32_t AD1FCBTIS:2;
    uint32_t AD1FCBTIP:3;
    uint32_t :3;
    uint32_t AD1G1IS:2;
    uint32_t AD1G1IP:3;
    uint32_t :3;
    uint32_t AD1D0IS:2;
    uint32_t AD1D0IP:3;
    uint32_t :3;
    uint32_t AD1D1IS:2;
    uint32_t AD1D1IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC26bits_t;
extern volatile __IPC26bits_t IPC26bits __asm__ ("IPC26") __attribute__((section("sfrs"), address(0xBF8102E0)));
extern volatile uint32_t        IPC26CLR __attribute__((section("sfrs"),address(0xBF8102E4)));
extern volatile uint32_t        IPC26SET __attribute__((section("sfrs"),address(0xBF8102E8)));
extern volatile uint32_t        IPC26INV __attribute__((section("sfrs"),address(0xBF8102EC)));
#define IPC27 IPC27
extern volatile uint32_t   IPC27 __attribute__((section("sfrs"), address(0xBF8102F0)));
typedef union {
  struct {
    uint32_t AD1D2IS:2;
    uint32_t AD1D2IP:3;
    uint32_t :3;
    uint32_t AD1D3IS:2;
    uint32_t AD1D3IP:3;
    uint32_t :3;
    uint32_t AD1D4IS:2;
    uint32_t AD1D4IP:3;
    uint32_t :3;
    uint32_t AD1D5IS:2;
    uint32_t AD1D5IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC27bits_t;
extern volatile __IPC27bits_t IPC27bits __asm__ ("IPC27") __attribute__((section("sfrs"), address(0xBF8102F0)));
extern volatile uint32_t        IPC27CLR __attribute__((section("sfrs"),address(0xBF8102F4)));
extern volatile uint32_t        IPC27SET __attribute__((section("sfrs"),address(0xBF8102F8)));
extern volatile uint32_t        IPC27INV __attribute__((section("sfrs"),address(0xBF8102FC)));
#define IPC28 IPC28
extern volatile uint32_t   IPC28 __attribute__((section("sfrs"), address(0xBF810300)));
typedef union {
  struct {
    uint32_t AD1D6IS:2;
    uint32_t AD1D6IP:3;
    uint32_t :3;
    uint32_t AD1D7IS:2;
    uint32_t AD1D7IP:3;
    uint32_t :3;
    uint32_t AD1D8IS:2;
    uint32_t AD1D8IP:3;
    uint32_t :3;
    uint32_t AD1D9IS:2;
    uint32_t AD1D9IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC28bits_t;
extern volatile __IPC28bits_t IPC28bits __asm__ ("IPC28") __attribute__((section("sfrs"), address(0xBF810300)));
extern volatile uint32_t        IPC28CLR __attribute__((section("sfrs"),address(0xBF810304)));
extern volatile uint32_t        IPC28SET __attribute__((section("sfrs"),address(0xBF810308)));
extern volatile uint32_t        IPC28INV __attribute__((section("sfrs"),address(0xBF81030C)));
#define IPC29 IPC29
extern volatile uint32_t   IPC29 __attribute__((section("sfrs"), address(0xBF810310)));
typedef union {
  struct {
    uint32_t AD1D10IS:2;
    uint32_t AD1D10IP:3;
    uint32_t :3;
    uint32_t AD1D11IS:2;
    uint32_t AD1D11IP:3;
    uint32_t :3;
    uint32_t AD1D12IS:2;
    uint32_t AD1D12IP:3;
    uint32_t :3;
    uint32_t AD1D13IS:2;
    uint32_t AD1D13IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC29bits_t;
extern volatile __IPC29bits_t IPC29bits __asm__ ("IPC29") __attribute__((section("sfrs"), address(0xBF810310)));
extern volatile uint32_t        IPC29CLR __attribute__((section("sfrs"),address(0xBF810314)));
extern volatile uint32_t        IPC29SET __attribute__((section("sfrs"),address(0xBF810318)));
extern volatile uint32_t        IPC29INV __attribute__((section("sfrs"),address(0xBF81031C)));
#define IPC30 IPC30
extern volatile uint32_t   IPC30 __attribute__((section("sfrs"), address(0xBF810320)));
typedef union {
  struct {
    uint32_t AD1D14IS:2;
    uint32_t AD1D14IP:3;
    uint32_t :3;
    uint32_t AD1D15IS:2;
    uint32_t AD1D15IP:3;
    uint32_t :3;
    uint32_t AD1D16IS:2;
    uint32_t AD1D16IP:3;
    uint32_t :3;
    uint32_t AD1D17IS:2;
    uint32_t AD1D17IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC30bits_t;
