Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
extern volatile __OFF250bits_t OFF250bits __asm__ ("OFF250") __attribute__((section("sfrs"), address(0xBF810928)));
#define OFF251 OFF251
extern volatile uint32_t   OFF251 __attribute__((section("sfrs"), address(0xBF81092C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF251bits_t;
extern volatile __OFF251bits_t OFF251bits __asm__ ("OFF251") __attribute__((section("sfrs"), address(0xBF81092C)));
#define OFF252 OFF252
extern volatile uint32_t   OFF252 __attribute__((section("sfrs"), address(0xBF810930)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF252bits_t;
extern volatile __OFF252bits_t OFF252bits __asm__ ("OFF252") __attribute__((section("sfrs"), address(0xBF810930)));
#define OFF254 OFF254
extern volatile uint32_t   OFF254 __attribute__((section("sfrs"), address(0xBF810938)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF254bits_t;
extern volatile __OFF254bits_t OFF254bits __asm__ ("OFF254") __attribute__((section("sfrs"), address(0xBF810938)));
#define OFF255 OFF255
extern volatile uint32_t   OFF255 __attribute__((section("sfrs"), address(0xBF81093C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF255bits_t;
extern volatile __OFF255bits_t OFF255bits __asm__ ("OFF255") __attribute__((section("sfrs"), address(0xBF81093C)));
#define DMACON DMACON
extern volatile uint32_t   DMACON __attribute__((section("sfrs"), address(0xBF811000)));
typedef struct {
  uint32_t :11;
  uint32_t DMABUSY:1;
  uint32_t SUSPEND:1;
  uint32_t :2;
  uint32_t ON:1;
} __DMACONbits_t;
extern volatile __DMACONbits_t DMACONbits __asm__ ("DMACON") __attribute__((section("sfrs"), address(0xBF811000)));
extern volatile uint32_t        DMACONCLR __attribute__((section("sfrs"),address(0xBF811004)));
extern volatile uint32_t        DMACONSET __attribute__((section("sfrs"),address(0xBF811008)));
extern volatile uint32_t        DMACONINV __attribute__((section("sfrs"),address(0xBF81100C)));
#define DMASTAT DMASTAT
extern volatile uint32_t   DMASTAT __attribute__((section("sfrs"), address(0xBF811010)));
typedef struct {
  uint32_t DMACH:3;
  uint32_t :28;
  uint32_t RDWR:1;
} __DMASTATbits_t;
extern volatile __DMASTATbits_t DMASTATbits __asm__ ("DMASTAT") __attribute__((section("sfrs"), address(0xBF811010)));
extern volatile uint32_t        DMASTATCLR __attribute__((section("sfrs"),address(0xBF811014)));
extern volatile uint32_t        DMASTATSET __attribute__((section("sfrs"),address(0xBF811018)));
extern volatile uint32_t        DMASTATINV __attribute__((section("sfrs"),address(0xBF81101C)));
#define DMAADDR DMAADDR
extern volatile uint32_t   DMAADDR __attribute__((section("sfrs"), address(0xBF811020)));
typedef struct {
  uint32_t DMAADDR:32;
} __DMAADDRbits_t;
extern volatile __DMAADDRbits_t DMAADDRbits __asm__ ("DMAADDR") __attribute__((section("sfrs"), address(0xBF811020)));
extern volatile uint32_t        DMAADDRCLR __attribute__((section("sfrs"),address(0xBF811024)));
extern volatile uint32_t        DMAADDRSET __attribute__((section("sfrs"),address(0xBF811028)));
extern volatile uint32_t        DMAADDRINV __attribute__((section("sfrs"),address(0xBF81102C)));
#define DCRCCON DCRCCON
extern volatile uint32_t   DCRCCON __attribute__((section("sfrs"), address(0xBF811030)));
typedef struct {
  uint32_t CRCCH:3;
  uint32_t :2;
  uint32_t CRCTYP:1;
  uint32_t CRCAPP:1;
  uint32_t CRCEN:1;
  uint32_t PLEN:5;
  uint32_t :11;
  uint32_t BITO:1;
  uint32_t :2;
  uint32_t WBO:1;
  uint32_t BYTO:2;
} __DCRCCONbits_t;
extern volatile __DCRCCONbits_t DCRCCONbits __asm__ ("DCRCCON") __attribute__((section("sfrs"), address(0xBF811030)));
extern volatile uint32_t        DCRCCONCLR __attribute__((section("sfrs"),address(0xBF811034)));
extern volatile uint32_t        DCRCCONSET __attribute__((section("sfrs"),address(0xBF811038)));
extern volatile uint32_t        DCRCCONINV __attribute__((section("sfrs"),address(0xBF81103C)));
#define DCRCDATA DCRCDATA
extern volatile uint32_t   DCRCDATA __attribute__((section("sfrs"), address(0xBF811040)));
typedef struct {
  uint32_t DCRCDATA:32;
} __DCRCDATAbits_t;
extern volatile __DCRCDATAbits_t DCRCDATAbits __asm__ ("DCRCDATA") __attribute__((section("sfrs"), address(0xBF811040)));
extern volatile uint32_t        DCRCDATACLR __attribute__((section("sfrs"),address(0xBF811044)));
extern volatile uint32_t        DCRCDATASET __attribute__((section("sfrs"),address(0xBF811048)));
extern volatile uint32_t        DCRCDATAINV __attribute__((section("sfrs"),address(0xBF81104C)));
#define DCRCXOR DCRCXOR
extern volatile uint32_t   DCRCXOR __attribute__((section("sfrs"), address(0xBF811050)));
typedef struct {
  uint32_t DCRCXOR:32;
} __DCRCXORbits_t;
extern volatile __DCRCXORbits_t DCRCXORbits __asm__ ("DCRCXOR") __attribute__((section("sfrs"), address(0xBF811050)));
extern volatile uint32_t        DCRCXORCLR __attribute__((section("sfrs"),address(0xBF811054)));
extern volatile uint32_t        DCRCXORSET __attribute__((section("sfrs"),address(0xBF811058)));
extern volatile uint32_t        DCRCXORINV __attribute__((section("sfrs"),address(0xBF81105C)));
#define DCH0CON DCH0CON
extern volatile uint32_t   DCH0CON __attribute__((section("sfrs"), address(0xBF811060)));
typedef struct {
  uint32_t CHPRI:2;
  uint32_t CHEDET:1;
  uint32_t :1;
  uint32_t CHAEN:1;
  uint32_t CHCHN:1;
  uint32_t CHAED:1;
  uint32_t CHEN:1;
  uint32_t CHCHNS:1;
  uint32_t :2;
  uint32_t CHPATLEN:1;
  uint32_t :1;
  uint32_t CHPIGNEN:1;
  uint32_t :1;
  uint32_t CHBUSY:1;
  uint32_t :8;
  uint32_t CHPIGN:8;
} __DCH0CONbits_t;
extern volatile __DCH0CONbits_t DCH0CONbits __asm__ ("DCH0CON") __attribute__((section("sfrs"), address(0xBF811060)));
extern volatile uint32_t        DCH0CONCLR __attribute__((section("sfrs"),address(0xBF811064)));
extern volatile uint32_t        DCH0CONSET __attribute__((section("sfrs"),address(0xBF811068)));
extern volatile uint32_t        DCH0CONINV __attribute__((section("sfrs"),address(0xBF81106C)));
#define DCH0ECON DCH0ECON
extern volatile uint32_t   DCH0ECON __attribute__((section("sfrs"), address(0xBF811070)));
typedef struct {
  uint32_t :3;
  uint32_t AIRQEN:1;
  uint32_t SIRQEN:1;
  uint32_t PATEN:1;
  uint32_t CABORT:1;
  uint32_t CFORCE:1;
  uint32_t CHSIRQ:8;
  uint32_t CHAIRQ:8;
} __DCH0ECONbits_t;
