Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
extern volatile __CNENDbits_t CNENDbits __asm__ ("CNEND") __attribute__((section("sfrs"), address(0xBF860380)));
extern volatile uint32_t        CNENDCLR __attribute__((section("sfrs"),address(0xBF860384)));
extern volatile uint32_t        CNENDSET __attribute__((section("sfrs"),address(0xBF860388)));
extern volatile uint32_t        CNENDINV __attribute__((section("sfrs"),address(0xBF86038C)));
#define CNSTATD CNSTATD
extern volatile uint32_t   CNSTATD __attribute__((section("sfrs"), address(0xBF860390)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t CNSTATD1:1;
    uint32_t CNSTATD2:1;
    uint32_t CNSTATD3:1;
    uint32_t CNSTATD4:1;
    uint32_t CNSTATD5:1;
    uint32_t CNSTATD6:1;
    uint32_t :1;
    uint32_t CNSTATD8:1;
    uint32_t :3;
    uint32_t CNSTATD12:1;
    uint32_t CNSTATD13:1;
    uint32_t CNSTATD14:1;
    uint32_t CNSTATD15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATDbits_t;
extern volatile __CNSTATDbits_t CNSTATDbits __asm__ ("CNSTATD") __attribute__((section("sfrs"), address(0xBF860390)));
extern volatile uint32_t        CNSTATDCLR __attribute__((section("sfrs"),address(0xBF860394)));
extern volatile uint32_t        CNSTATDSET __attribute__((section("sfrs"),address(0xBF860398)));
extern volatile uint32_t        CNSTATDINV __attribute__((section("sfrs"),address(0xBF86039C)));
#define CNNED CNNED
extern volatile uint32_t   CNNED __attribute__((section("sfrs"), address(0xBF8603A0)));
typedef struct {
  uint32_t :1;
  uint32_t CNNED1:1;
  uint32_t CNNED2:1;
  uint32_t CNNED3:1;
  uint32_t CNNED4:1;
  uint32_t CNNED5:1;
  uint32_t CNNED6:1;
  uint32_t :1;
  uint32_t CNNED8:1;
  uint32_t :3;
  uint32_t CNNED12:1;
  uint32_t CNNED13:1;
  uint32_t CNNED14:1;
  uint32_t CNNED15:1;
} __CNNEDbits_t;
extern volatile __CNNEDbits_t CNNEDbits __asm__ ("CNNED") __attribute__((section("sfrs"), address(0xBF8603A0)));
extern volatile uint32_t        CNNEDCLR __attribute__((section("sfrs"),address(0xBF8603A4)));
extern volatile uint32_t        CNNEDSET __attribute__((section("sfrs"),address(0xBF8603A8)));
extern volatile uint32_t        CNNEDINV __attribute__((section("sfrs"),address(0xBF8603AC)));
#define CNFD CNFD
extern volatile uint32_t   CNFD __attribute__((section("sfrs"), address(0xBF8603B0)));
typedef struct {
  uint32_t :1;
  uint32_t CNFD1:1;
  uint32_t CNFD2:1;
  uint32_t CNFD3:1;
  uint32_t CNFD4:1;
  uint32_t CNFD5:1;
  uint32_t CNFD6:1;
  uint32_t :1;
  uint32_t CNFD8:1;
  uint32_t :3;
  uint32_t CNFD12:1;
  uint32_t CNFD13:1;
  uint32_t CNFD14:1;
  uint32_t CNFD15:1;
} __CNFDbits_t;
extern volatile __CNFDbits_t CNFDbits __asm__ ("CNFD") __attribute__((section("sfrs"), address(0xBF8603B0)));
extern volatile uint32_t        CNFDCLR __attribute__((section("sfrs"),address(0xBF8603B4)));
extern volatile uint32_t        CNFDSET __attribute__((section("sfrs"),address(0xBF8603B8)));
extern volatile uint32_t        CNFDINV __attribute__((section("sfrs"),address(0xBF8603BC)));
#define SRCON0D SRCON0D
extern volatile uint32_t   SRCON0D __attribute__((section("sfrs"), address(0xBF8603C0)));
typedef struct {
  uint32_t :1;
  uint32_t SR0D1:1;
  uint32_t SR0D2:1;
  uint32_t SR0D3:1;
  uint32_t SR0D4:1;
  uint32_t SR0D5:1;
  uint32_t SR0D6:1;
  uint32_t :1;
  uint32_t SR0D8:1;
} __SRCON0Dbits_t;
extern volatile __SRCON0Dbits_t SRCON0Dbits __asm__ ("SRCON0D") __attribute__((section("sfrs"), address(0xBF8603C0)));
extern volatile uint32_t        SRCON0DCLR __attribute__((section("sfrs"),address(0xBF8603C4)));
extern volatile uint32_t        SRCON0DSET __attribute__((section("sfrs"),address(0xBF8603C8)));
extern volatile uint32_t        SRCON0DINV __attribute__((section("sfrs"),address(0xBF8603CC)));
#define SRCON1D SRCON1D
extern volatile uint32_t   SRCON1D __attribute__((section("sfrs"), address(0xBF8603D0)));
typedef struct {
  uint32_t :1;
  uint32_t SR1D1:1;
  uint32_t SR1D2:1;
  uint32_t SR1D3:1;
  uint32_t SR1D4:1;
  uint32_t SR1D5:1;
  uint32_t SR1D6:1;
  uint32_t :1;
  uint32_t SR1D8:1;
} __SRCON1Dbits_t;
extern volatile __SRCON1Dbits_t SRCON1Dbits __asm__ ("SRCON1D") __attribute__((section("sfrs"), address(0xBF8603D0)));
extern volatile uint32_t        SRCON1DCLR __attribute__((section("sfrs"),address(0xBF8603D4)));
extern volatile uint32_t        SRCON1DSET __attribute__((section("sfrs"),address(0xBF8603D8)));
extern volatile uint32_t        SRCON1DINV __attribute__((section("sfrs"),address(0xBF8603DC)));
#define CFD1CON CFD1CON
extern volatile uint32_t   CFD1CON __attribute__((section("sfrs"), address(0xBF880000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t ISOCRCEN:1;
    uint32_t PXEDIS:1;
    uint32_t CLKSEL0:1;
    uint32_t WAKFIL:1;
    uint32_t WFT:2;
    uint32_t BUSY:1;
    uint32_t BRSDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t RTXAT:1;
    uint32_t ESIGM:1;
    uint32_t SERR2LOM:1;
    uint32_t STEF:1;
    uint32_t TXQEN:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
    uint32_t TXBWS:4;
  };
  struct {
    uint32_t w:32;
  };
} __CFD1CONbits_t;
extern volatile __CFD1CONbits_t CFD1CONbits __asm__ ("CFD1CON") __attribute__((section("sfrs"), address(0xBF880000)));
extern volatile uint32_t        CFD1CONCLR __attribute__((section("sfrs"),address(0xBF880004)));
extern volatile uint32_t        CFD1CONSET __attribute__((section("sfrs"),address(0xBF880008)));
extern volatile uint32_t        CFD1CONINV __attribute__((section("sfrs"),address(0xBF88000C)));
#define CFD1NBTCFG CFD1NBTCFG
extern volatile uint32_t   CFD1NBTCFG __attribute__((section("sfrs"), address(0xBF880010)));
typedef struct {
  uint32_t SJW:7;
  uint32_t :1;
  uint32_t TSEG2:7;
  uint32_t :1;
  uint32_t TSEG1:8;
  uint32_t BRP:8;
} __CFD1NBTCFGbits_t;
extern volatile __CFD1NBTCFGbits_t CFD1NBTCFGbits __asm__ ("CFD1NBTCFG") __attribute__((section("sfrs"), address(0xBF880010)));
extern volatile uint32_t        CFD1NBTCFGCLR __attribute__((section("sfrs"),address(0xBF880014)));
extern volatile uint32_t        CFD1NBTCFGSET __attribute__((section("sfrs"),address(0xBF880018)));
extern volatile uint32_t        CFD1NBTCFGINV __attribute__((section("sfrs"),address(0xBF88001C)));
#define CFD1DBTCFG CFD1DBTCFG
extern volatile uint32_t   CFD1DBTCFG __attribute__((section("sfrs"), address(0xBF880020)));
typedef struct {
  uint32_t SJW:4;
  uint32_t :4;
  uint32_t TSEG2:4;
  uint32_t :4;
  uint32_t TSEG1:5;
  uint32_t :3;
  uint32_t BRP:8;
} __CFD1DBTCFGbits_t;
extern volatile __CFD1DBTCFGbits_t CFD1DBTCFGbits __asm__ ("CFD1DBTCFG") __attribute__((section("sfrs"), address(0xBF880020)));
extern volatile uint32_t        CFD1DBTCFGCLR __attribute__((section("sfrs"),address(0xBF880024)));
extern volatile uint32_t        CFD1DBTCFGSET __attribute__((section("sfrs"),address(0xBF880028)));
extern volatile uint32_t        CFD1DBTCFGINV __attribute__((section("sfrs"),address(0xBF88002C)));
#define CFD1TDC CFD1TDC
extern volatile uint32_t   CFD1TDC __attribute__((section("sfrs"), address(0xBF880030)));
typedef struct {
  uint32_t TDCV:6;
  uint32_t :2;
  uint32_t TDCO:7;
  uint32_t :1;
  uint32_t TDCMOD:2;
  uint32_t :6;
  uint32_t SID11EN:1;
  uint32_t EDGFLTEN:1;
} __CFD1TDCbits_t;
extern volatile __CFD1TDCbits_t CFD1TDCbits __asm__ ("CFD1TDC") __attribute__((section("sfrs"), address(0xBF880030)));
extern volatile uint32_t        CFD1TDCCLR __attribute__((section("sfrs"),address(0xBF880034)));
extern volatile uint32_t        CFD1TDCSET __attribute__((section("sfrs"),address(0xBF880038)));
extern volatile uint32_t        CFD1TDCINV __attribute__((section("sfrs"),address(0xBF88003C)));
#define CFD1TBC CFD1TBC
extern volatile uint32_t   CFD1TBC __attribute__((section("sfrs"), address(0xBF880040)));
typedef struct {
  uint32_t TBC:32;
} __CFD1TBCbits_t;
extern volatile __CFD1TBCbits_t CFD1TBCbits __asm__ ("CFD1TBC") __attribute__((section("sfrs"), address(0xBF880040)));
extern volatile uint32_t        CFD1TBCCLR __attribute__((section("sfrs"),address(0xBF880044)));
extern volatile uint32_t        CFD1TBCSET __attribute__((section("sfrs"),address(0xBF880048)));
extern volatile uint32_t        CFD1TBCINV __attribute__((section("sfrs"),address(0xBF88004C)));
#define CFD1TSCON CFD1TSCON
extern volatile uint32_t   CFD1TSCON __attribute__((section("sfrs"), address(0xBF880050)));
typedef struct {
  uint32_t TBCPRE:10;
  uint32_t :6;
  uint32_t TBCEN:1;
  uint32_t TSEOF:1;
  uint32_t TSRES:1;
} __CFD1TSCONbits_t;
extern volatile __CFD1TSCONbits_t CFD1TSCONbits __asm__ ("CFD1TSCON") __attribute__((section("sfrs"), address(0xBF880050)));
extern volatile uint32_t        CFD1TSCONCLR __attribute__((section("sfrs"),address(0xBF880054)));
extern volatile uint32_t        CFD1TSCONSET __attribute__((section("sfrs"),address(0xBF880058)));
extern volatile uint32_t        CFD1TSCONINV __attribute__((section("sfrs"),address(0xBF88005C)));
#define CFD1VEC CFD1VEC
extern volatile uint32_t   CFD1VEC __attribute__((section("sfrs"), address(0xBF880060)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
    uint32_t :3;
    uint32_t TXCODE:7;
    uint32_t :1;
    uint32_t RXCODE:7;
  };
  struct {
    uint32_t w:32;
  };
} __CFD1VECbits_t;
extern volatile __CFD1VECbits_t CFD1VECbits __asm__ ("CFD1VEC") __attribute__((section("sfrs"), address(0xBF880060)));
extern volatile uint32_t        CFD1VECCLR __attribute__((section("sfrs"),address(0xBF880064)));
extern volatile uint32_t        CFD1VECSET __attribute__((section("sfrs"),address(0xBF880068)));
extern volatile uint32_t        CFD1VECINV __attribute__((section("sfrs"),address(0xBF88006C)));
#define CFD1INT CFD1INT
extern volatile uint32_t   CFD1INT __attribute__((section("sfrs"), address(0xBF880070)));
typedef union {
  struct {
    uint32_t TXIF:1;
    uint32_t RXIF:1;
    uint32_t TBCIF:1;
    uint32_t MODIF:1;
    uint32_t TEFIF:1;
    uint32_t :5;
    uint32_t TXATIF:1;
    uint32_t RXOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVMIF:1;
    uint32_t TXIE:1;
    uint32_t RXIE:1;
    uint32_t TBCIE:1;
    uint32_t MODIE:1;
    uint32_t TEFIE:1;
    uint32_t :5;
    uint32_t TXATIE:1;
    uint32_t RXOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVMIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD1INTbits_t;
