Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
extern volatile __CFD1INTbits_t CFD1INTbits __asm__ ("CFD1INT") __attribute__((section("sfrs"), address(0xBF880070)));
extern volatile uint32_t        CFD1INTCLR __attribute__((section("sfrs"),address(0xBF880074)));
extern volatile uint32_t        CFD1INTSET __attribute__((section("sfrs"),address(0xBF880078)));
extern volatile uint32_t        CFD1INTINV __attribute__((section("sfrs"),address(0xBF88007C)));
#define CFD1RXIF CFD1RXIF
extern volatile uint32_t   CFD1RXIF __attribute__((section("sfrs"), address(0xBF880080)));
typedef struct {
  uint32_t :1;
  uint32_t RFIF:31;
} __CFD1RXIFbits_t;
extern volatile __CFD1RXIFbits_t CFD1RXIFbits __asm__ ("CFD1RXIF") __attribute__((section("sfrs"), address(0xBF880080)));
extern volatile uint32_t        CFD1RXIFCLR __attribute__((section("sfrs"),address(0xBF880084)));
extern volatile uint32_t        CFD1RXIFSET __attribute__((section("sfrs"),address(0xBF880088)));
extern volatile uint32_t        CFD1RXIFINV __attribute__((section("sfrs"),address(0xBF88008C)));
#define CFD1TXIF CFD1TXIF
extern volatile uint32_t   CFD1TXIF __attribute__((section("sfrs"), address(0xBF880090)));
typedef struct {
  uint32_t TFIF:32;
} __CFD1TXIFbits_t;
extern volatile __CFD1TXIFbits_t CFD1TXIFbits __asm__ ("CFD1TXIF") __attribute__((section("sfrs"), address(0xBF880090)));
extern volatile uint32_t        CFD1TXIFCLR __attribute__((section("sfrs"),address(0xBF880094)));
extern volatile uint32_t        CFD1TXIFSET __attribute__((section("sfrs"),address(0xBF880098)));
extern volatile uint32_t        CFD1TXIFINV __attribute__((section("sfrs"),address(0xBF88009C)));
#define CFD1RXOVIF CFD1RXOVIF
extern volatile uint32_t   CFD1RXOVIF __attribute__((section("sfrs"), address(0xBF8800A0)));
typedef struct {
  uint32_t :1;
  uint32_t RFOVIF:31;
} __CFD1RXOVIFbits_t;
extern volatile __CFD1RXOVIFbits_t CFD1RXOVIFbits __asm__ ("CFD1RXOVIF") __attribute__((section("sfrs"), address(0xBF8800A0)));
extern volatile uint32_t        CFD1RXOVIFCLR __attribute__((section("sfrs"),address(0xBF8800A4)));
extern volatile uint32_t        CFD1RXOVIFSET __attribute__((section("sfrs"),address(0xBF8800A8)));
extern volatile uint32_t        CFD1RXOVIFINV __attribute__((section("sfrs"),address(0xBF8800AC)));
#define CFD1TXATIF CFD1TXATIF
extern volatile uint32_t   CFD1TXATIF __attribute__((section("sfrs"), address(0xBF8800B0)));
typedef struct {
  uint32_t TFATIF:32;
} __CFD1TXATIFbits_t;
extern volatile __CFD1TXATIFbits_t CFD1TXATIFbits __asm__ ("CFD1TXATIF") __attribute__((section("sfrs"), address(0xBF8800B0)));
extern volatile uint32_t        CFD1TXATIFCLR __attribute__((section("sfrs"),address(0xBF8800B4)));
extern volatile uint32_t        CFD1TXATIFSET __attribute__((section("sfrs"),address(0xBF8800B8)));
extern volatile uint32_t        CFD1TXATIFINV __attribute__((section("sfrs"),address(0xBF8800BC)));
#define CFD1TXREQ CFD1TXREQ
extern volatile uint32_t   CFD1TXREQ __attribute__((section("sfrs"), address(0xBF8800C0)));
typedef struct {
  uint32_t TXREQ:32;
} __CFD1TXREQbits_t;
extern volatile __CFD1TXREQbits_t CFD1TXREQbits __asm__ ("CFD1TXREQ") __attribute__((section("sfrs"), address(0xBF8800C0)));
extern volatile uint32_t        CFD1TXREQCLR __attribute__((section("sfrs"),address(0xBF8800C4)));
extern volatile uint32_t        CFD1TXREQSET __attribute__((section("sfrs"),address(0xBF8800C8)));
extern volatile uint32_t        CFD1TXREQINV __attribute__((section("sfrs"),address(0xBF8800CC)));
#define CFD1TREC CFD1TREC
extern volatile uint32_t   CFD1TREC __attribute__((section("sfrs"), address(0xBF8800D0)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD1TRECbits_t;
extern volatile __CFD1TRECbits_t CFD1TRECbits __asm__ ("CFD1TREC") __attribute__((section("sfrs"), address(0xBF8800D0)));
extern volatile uint32_t        CFD1TRECCLR __attribute__((section("sfrs"),address(0xBF8800D4)));
extern volatile uint32_t        CFD1TRECSET __attribute__((section("sfrs"),address(0xBF8800D8)));
extern volatile uint32_t        CFD1TRECINV __attribute__((section("sfrs"),address(0xBF8800DC)));
#define CFD1BDIAG0 CFD1BDIAG0
extern volatile uint32_t   CFD1BDIAG0 __attribute__((section("sfrs"), address(0xBF8800E0)));
typedef struct {
  uint32_t NRERRCNT:8;
  uint32_t NTERRCNT:8;
  uint32_t DRERRCNT:8;
  uint32_t DTERRCNT:8;
} __CFD1BDIAG0bits_t;
extern volatile __CFD1BDIAG0bits_t CFD1BDIAG0bits __asm__ ("CFD1BDIAG0") __attribute__((section("sfrs"), address(0xBF8800E0)));
extern volatile uint32_t        CFD1BDIAG0CLR __attribute__((section("sfrs"),address(0xBF8800E4)));
extern volatile uint32_t        CFD1BDIAG0SET __attribute__((section("sfrs"),address(0xBF8800E8)));
extern volatile uint32_t        CFD1BDIAG0INV __attribute__((section("sfrs"),address(0xBF8800EC)));
#define CFD1BDIAG1 CFD1BDIAG1
extern volatile uint32_t   CFD1BDIAG1 __attribute__((section("sfrs"), address(0xBF8800F0)));
typedef struct {
  uint32_t EFMSGCNT:16;
  uint32_t NBIT0ERR:1;
  uint32_t NBIT1ERR:1;
  uint32_t NACKERR:1;
  uint32_t NFORMERR:1;
  uint32_t NSTUFERR:1;
  uint32_t NCRCERR:1;
  uint32_t :2;
  uint32_t DBIT0ERR:1;
  uint32_t DBIT1ERR:1;
  uint32_t :1;
  uint32_t DFORMERR:1;
  uint32_t DSTUFERR:1;
  uint32_t DCRCERR:1;
  uint32_t ESI:1;
  uint32_t DLCMM:1;
} __CFD1BDIAG1bits_t;
extern volatile __CFD1BDIAG1bits_t CFD1BDIAG1bits __asm__ ("CFD1BDIAG1") __attribute__((section("sfrs"), address(0xBF8800F0)));
extern volatile uint32_t        CFD1BDIAG1CLR __attribute__((section("sfrs"),address(0xBF8800F4)));
extern volatile uint32_t        CFD1BDIAG1SET __attribute__((section("sfrs"),address(0xBF8800F8)));
extern volatile uint32_t        CFD1BDIAG1INV __attribute__((section("sfrs"),address(0xBF8800FC)));
#define CFD1TEFCON CFD1TEFCON
extern volatile uint32_t   CFD1TEFCON __attribute__((section("sfrs"), address(0xBF880100)));
typedef struct {
  uint32_t TEFNEIE:1;
  uint32_t TEFHIE:1;
  uint32_t TEFFIE:1;
  uint32_t TEFOVIE:1;
  uint32_t :1;
  uint32_t TEFTSEN:1;
  uint32_t :2;
  uint32_t UINC:1;
  uint32_t :1;
  uint32_t FRESET:1;
  uint32_t :13;
  uint32_t FSIZE:5;
} __CFD1TEFCONbits_t;
extern volatile __CFD1TEFCONbits_t CFD1TEFCONbits __asm__ ("CFD1TEFCON") __attribute__((section("sfrs"), address(0xBF880100)));
extern volatile uint32_t        CFD1TEFCONCLR __attribute__((section("sfrs"),address(0xBF880104)));
extern volatile uint32_t        CFD1TEFCONSET __attribute__((section("sfrs"),address(0xBF880108)));
extern volatile uint32_t        CFD1TEFCONINV __attribute__((section("sfrs"),address(0xBF88010C)));
#define CFD1TEFSTA CFD1TEFSTA
extern volatile uint32_t   CFD1TEFSTA __attribute__((section("sfrs"), address(0xBF880110)));
typedef struct {
  uint32_t TEFNEIF:1;
  uint32_t TEFHIF:1;
  uint32_t TEFFIF:1;
  uint32_t TEFOVIF:1;
} __CFD1TEFSTAbits_t;
extern volatile __CFD1TEFSTAbits_t CFD1TEFSTAbits __asm__ ("CFD1TEFSTA") __attribute__((section("sfrs"), address(0xBF880110)));
extern volatile uint32_t        CFD1TEFSTACLR __attribute__((section("sfrs"),address(0xBF880114)));
extern volatile uint32_t        CFD1TEFSTASET __attribute__((section("sfrs"),address(0xBF880118)));
extern volatile uint32_t        CFD1TEFSTAINV __attribute__((section("sfrs"),address(0xBF88011C)));
#define CFD1TEFUA CFD1TEFUA
extern volatile uint32_t   CFD1TEFUA __attribute__((section("sfrs"), address(0xBF880120)));
typedef struct {
  uint32_t TEFUA:32;
} __CFD1TEFUAbits_t;
extern volatile __CFD1TEFUAbits_t CFD1TEFUAbits __asm__ ("CFD1TEFUA") __attribute__((section("sfrs"), address(0xBF880120)));
extern volatile uint32_t        CFD1TEFUACLR __attribute__((section("sfrs"),address(0xBF880124)));
extern volatile uint32_t        CFD1TEFUASET __attribute__((section("sfrs"),address(0xBF880128)));
extern volatile uint32_t        CFD1TEFUAINV __attribute__((section("sfrs"),address(0xBF88012C)));
#define CFD1FIFOBA CFD1FIFOBA
extern volatile uint32_t   CFD1FIFOBA __attribute__((section("sfrs"), address(0xBF880130)));
typedef struct {
  uint32_t FIFOBA:32;
} __CFD1FIFOBAbits_t;
extern volatile __CFD1FIFOBAbits_t CFD1FIFOBAbits __asm__ ("CFD1FIFOBA") __attribute__((section("sfrs"), address(0xBF880130)));
extern volatile uint32_t        CFD1FIFOBACLR __attribute__((section("sfrs"),address(0xBF880134)));
extern volatile uint32_t        CFD1FIFOBASET __attribute__((section("sfrs"),address(0xBF880138)));
extern volatile uint32_t        CFD1FIFOBAINV __attribute__((section("sfrs"),address(0xBF88013C)));
#define CFD1TXQCON CFD1TXQCON
extern volatile uint32_t   CFD1TXQCON __attribute__((section("sfrs"), address(0xBF880140)));
typedef struct {
  uint32_t TXQNIE:1;
  uint32_t :1;
  uint32_t TXQEIE:1;
  uint32_t :1;
  uint32_t TXATIE:1;
  uint32_t :2;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1TXQCONbits_t;
extern volatile __CFD1TXQCONbits_t CFD1TXQCONbits __asm__ ("CFD1TXQCON") __attribute__((section("sfrs"), address(0xBF880140)));
extern volatile uint32_t        CFD1TXQCONCLR __attribute__((section("sfrs"),address(0xBF880144)));
extern volatile uint32_t        CFD1TXQCONSET __attribute__((section("sfrs"),address(0xBF880148)));
extern volatile uint32_t        CFD1TXQCONINV __attribute__((section("sfrs"),address(0xBF88014C)));
#define CFD1TXQSTA CFD1TXQSTA
extern volatile uint32_t   CFD1TXQSTA __attribute__((section("sfrs"), address(0xBF880150)));
typedef struct {
  uint32_t TXQNIF:1;
  uint32_t :1;
  uint32_t TXQEIF:1;
  uint32_t :1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t TXQCI:5;
} __CFD1TXQSTAbits_t;
