Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
extern volatile __CFD1FLTOBJ4bits_t CFD1FLTOBJ4bits __asm__ ("CFD1FLTOBJ4") __attribute__((section("sfrs"), address(0xBF880840)));
extern volatile uint32_t        CFD1FLTOBJ4CLR __attribute__((section("sfrs"),address(0xBF880844)));
extern volatile uint32_t        CFD1FLTOBJ4SET __attribute__((section("sfrs"),address(0xBF880848)));
extern volatile uint32_t        CFD1FLTOBJ4INV __attribute__((section("sfrs"),address(0xBF88084C)));
#define CFD1MASK4 CFD1MASK4
extern volatile uint32_t   CFD1MASK4 __attribute__((section("sfrs"), address(0xBF880850)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK4bits_t;
extern volatile __CFD1MASK4bits_t CFD1MASK4bits __asm__ ("CFD1MASK4") __attribute__((section("sfrs"), address(0xBF880850)));
extern volatile uint32_t        CFD1MASK4CLR __attribute__((section("sfrs"),address(0xBF880854)));
extern volatile uint32_t        CFD1MASK4SET __attribute__((section("sfrs"),address(0xBF880858)));
extern volatile uint32_t        CFD1MASK4INV __attribute__((section("sfrs"),address(0xBF88085C)));
#define CFD1FLTOBJ5 CFD1FLTOBJ5
extern volatile uint32_t   CFD1FLTOBJ5 __attribute__((section("sfrs"), address(0xBF880860)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ5bits_t;
extern volatile __CFD1FLTOBJ5bits_t CFD1FLTOBJ5bits __asm__ ("CFD1FLTOBJ5") __attribute__((section("sfrs"), address(0xBF880860)));
extern volatile uint32_t        CFD1FLTOBJ5CLR __attribute__((section("sfrs"),address(0xBF880864)));
extern volatile uint32_t        CFD1FLTOBJ5SET __attribute__((section("sfrs"),address(0xBF880868)));
extern volatile uint32_t        CFD1FLTOBJ5INV __attribute__((section("sfrs"),address(0xBF88086C)));
#define CFD1MASK5 CFD1MASK5
extern volatile uint32_t   CFD1MASK5 __attribute__((section("sfrs"), address(0xBF880870)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK5bits_t;
extern volatile __CFD1MASK5bits_t CFD1MASK5bits __asm__ ("CFD1MASK5") __attribute__((section("sfrs"), address(0xBF880870)));
extern volatile uint32_t        CFD1MASK5CLR __attribute__((section("sfrs"),address(0xBF880874)));
extern volatile uint32_t        CFD1MASK5SET __attribute__((section("sfrs"),address(0xBF880878)));
extern volatile uint32_t        CFD1MASK5INV __attribute__((section("sfrs"),address(0xBF88087C)));
#define CFD1FLTOBJ6 CFD1FLTOBJ6
extern volatile uint32_t   CFD1FLTOBJ6 __attribute__((section("sfrs"), address(0xBF880880)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ6bits_t;
extern volatile __CFD1FLTOBJ6bits_t CFD1FLTOBJ6bits __asm__ ("CFD1FLTOBJ6") __attribute__((section("sfrs"), address(0xBF880880)));
extern volatile uint32_t        CFD1FLTOBJ6CLR __attribute__((section("sfrs"),address(0xBF880884)));
extern volatile uint32_t        CFD1FLTOBJ6SET __attribute__((section("sfrs"),address(0xBF880888)));
extern volatile uint32_t        CFD1FLTOBJ6INV __attribute__((section("sfrs"),address(0xBF88088C)));
#define CFD1MASK6 CFD1MASK6
extern volatile uint32_t   CFD1MASK6 __attribute__((section("sfrs"), address(0xBF880890)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK6bits_t;
extern volatile __CFD1MASK6bits_t CFD1MASK6bits __asm__ ("CFD1MASK6") __attribute__((section("sfrs"), address(0xBF880890)));
extern volatile uint32_t        CFD1MASK6CLR __attribute__((section("sfrs"),address(0xBF880894)));
extern volatile uint32_t        CFD1MASK6SET __attribute__((section("sfrs"),address(0xBF880898)));
extern volatile uint32_t        CFD1MASK6INV __attribute__((section("sfrs"),address(0xBF88089C)));
#define CFD1FLTOBJ7 CFD1FLTOBJ7
extern volatile uint32_t   CFD1FLTOBJ7 __attribute__((section("sfrs"), address(0xBF8808A0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ7bits_t;
extern volatile __CFD1FLTOBJ7bits_t CFD1FLTOBJ7bits __asm__ ("CFD1FLTOBJ7") __attribute__((section("sfrs"), address(0xBF8808A0)));
extern volatile uint32_t        CFD1FLTOBJ7CLR __attribute__((section("sfrs"),address(0xBF8808A4)));
extern volatile uint32_t        CFD1FLTOBJ7SET __attribute__((section("sfrs"),address(0xBF8808A8)));
extern volatile uint32_t        CFD1FLTOBJ7INV __attribute__((section("sfrs"),address(0xBF8808AC)));
#define CFD1MASK7 CFD1MASK7
extern volatile uint32_t   CFD1MASK7 __attribute__((section("sfrs"), address(0xBF8808B0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK7bits_t;
extern volatile __CFD1MASK7bits_t CFD1MASK7bits __asm__ ("CFD1MASK7") __attribute__((section("sfrs"), address(0xBF8808B0)));
extern volatile uint32_t        CFD1MASK7CLR __attribute__((section("sfrs"),address(0xBF8808B4)));
extern volatile uint32_t        CFD1MASK7SET __attribute__((section("sfrs"),address(0xBF8808B8)));
#define CFD1FLTOBJ8 CFD1FLTOBJ8
extern volatile uint32_t   CFD1FLTOBJ8 __attribute__((section("sfrs"), address(0xBF8808C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ8bits_t;
extern volatile __CFD1FLTOBJ8bits_t CFD1FLTOBJ8bits __asm__ ("CFD1FLTOBJ8") __attribute__((section("sfrs"), address(0xBF8808C0)));
extern volatile uint32_t        CFD1FLTOBJ8CLR __attribute__((section("sfrs"),address(0xBF8808C4)));
extern volatile uint32_t        CFD1FLTOBJ8SET __attribute__((section("sfrs"),address(0xBF8808C8)));
extern volatile uint32_t        CFD1FLTOBJ8INV __attribute__((section("sfrs"),address(0xBF8808CC)));
#define CFD1MASK8 CFD1MASK8
extern volatile uint32_t   CFD1MASK8 __attribute__((section("sfrs"), address(0xBF8808D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK8bits_t;
extern volatile __CFD1MASK8bits_t CFD1MASK8bits __asm__ ("CFD1MASK8") __attribute__((section("sfrs"), address(0xBF8808D0)));
extern volatile uint32_t        CFD1MASK8CLR __attribute__((section("sfrs"),address(0xBF8808D4)));
extern volatile uint32_t        CFD1MASK8SET __attribute__((section("sfrs"),address(0xBF8808D8)));
extern volatile uint32_t        CFD1MASK8INV __attribute__((section("sfrs"),address(0xBF8808DC)));
#define CFD1FLTOBJ9 CFD1FLTOBJ9
extern volatile uint32_t   CFD1FLTOBJ9 __attribute__((section("sfrs"), address(0xBF8808E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD1FLTOBJ9bits_t;
extern volatile __CFD1FLTOBJ9bits_t CFD1FLTOBJ9bits __asm__ ("CFD1FLTOBJ9") __attribute__((section("sfrs"), address(0xBF8808E0)));
extern volatile uint32_t        CFD1FLTOBJ9CLR __attribute__((section("sfrs"),address(0xBF8808E4)));
extern volatile uint32_t        CFD1FLTOBJ9SET __attribute__((section("sfrs"),address(0xBF8808E8)));
extern volatile uint32_t        CFD1FLTOBJ9INV __attribute__((section("sfrs"),address(0xBF8808EC)));
#define CFD1MASK9 CFD1MASK9
extern volatile uint32_t   CFD1MASK9 __attribute__((section("sfrs"), address(0xBF8808F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD1MASK9bits_t;
