Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
extern volatile __RTCTIMEbits_t RTCTIMEbits __asm__ ("RTCTIME") __attribute__((section("sfrs"), address(0xBF8C0020)));
extern volatile uint32_t        RTCTIMECLR __attribute__((section("sfrs"),address(0xBF8C0024)));
extern volatile uint32_t        RTCTIMESET __attribute__((section("sfrs"),address(0xBF8C0028)));
extern volatile uint32_t        RTCTIMEINV __attribute__((section("sfrs"),address(0xBF8C002C)));
#define RTCDATE RTCDATE
extern volatile uint32_t   RTCDATE __attribute__((section("sfrs"), address(0xBF8C0030)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
    uint32_t YEAR01:4;
    uint32_t YEAR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __RTCDATEbits_t;
extern volatile __RTCDATEbits_t RTCDATEbits __asm__ ("RTCDATE") __attribute__((section("sfrs"), address(0xBF8C0030)));
extern volatile uint32_t        RTCDATECLR __attribute__((section("sfrs"),address(0xBF8C0034)));
extern volatile uint32_t        RTCDATESET __attribute__((section("sfrs"),address(0xBF8C0038)));
extern volatile uint32_t        RTCDATEINV __attribute__((section("sfrs"),address(0xBF8C003C)));
#define ALRMTIME ALRMTIME
extern volatile uint32_t   ALRMTIME __attribute__((section("sfrs"), address(0xBF8C0040)));
typedef union {
  struct {
    uint32_t :8;
    uint32_t SEC01:4;
    uint32_t SEC10:4;
    uint32_t MIN01:4;
    uint32_t MIN10:4;
    uint32_t HR01:4;
    uint32_t HR10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMTIMEbits_t;
extern volatile __ALRMTIMEbits_t ALRMTIMEbits __asm__ ("ALRMTIME") __attribute__((section("sfrs"), address(0xBF8C0040)));
extern volatile uint32_t        ALRMTIMECLR __attribute__((section("sfrs"),address(0xBF8C0044)));
extern volatile uint32_t        ALRMTIMESET __attribute__((section("sfrs"),address(0xBF8C0048)));
extern volatile uint32_t        ALRMTIMEINV __attribute__((section("sfrs"),address(0xBF8C004C)));
#define ALRMDATE ALRMDATE
extern volatile uint32_t   ALRMDATE __attribute__((section("sfrs"), address(0xBF8C0050)));
typedef union {
  struct {
    uint32_t WDAY01:4;
    uint32_t :4;
    uint32_t DAY01:4;
    uint32_t DAY10:4;
    uint32_t MONTH01:4;
    uint32_t MONTH10:4;
  };
  struct {
    uint32_t w:32;
  };
} __ALRMDATEbits_t;
extern volatile __ALRMDATEbits_t ALRMDATEbits __asm__ ("ALRMDATE") __attribute__((section("sfrs"), address(0xBF8C0050)));
extern volatile uint32_t        ALRMDATECLR __attribute__((section("sfrs"),address(0xBF8C0054)));
extern volatile uint32_t        ALRMDATESET __attribute__((section("sfrs"),address(0xBF8C0058)));
extern volatile uint32_t        ALRMDATEINV __attribute__((section("sfrs"),address(0xBF8C005C)));
#define DSCON DSCON
extern volatile uint32_t   DSCON __attribute__((section("sfrs"), address(0xBF8C0200)));
typedef union {
  struct {
    uint32_t RELEASE:1;
    uint32_t DSBOR:1;
    uint32_t :6;
    uint32_t RTCCWDIS:1;
    uint32_t :3;
    uint32_t RTCDIS:1;
    uint32_t DSGPREN:1;
    uint32_t :1;
    uint32_t DSEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DSCONbits_t;
extern volatile __DSCONbits_t DSCONbits __asm__ ("DSCON") __attribute__((section("sfrs"), address(0xBF8C0200)));
#define DSWAKE DSWAKE
extern volatile uint32_t   DSWAKE __attribute__((section("sfrs"), address(0xBF8C0204)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t DSMCLR:1;
    uint32_t DSRTC:1;
    uint32_t DSWDT:1;
    uint32_t :2;
    uint32_t DSFLT:1;
    uint32_t DSINT0:1;
  };
  struct {
    uint32_t w:32;
  };
} __DSWAKEbits_t;
extern volatile __DSWAKEbits_t DSWAKEbits __asm__ ("DSWAKE") __attribute__((section("sfrs"), address(0xBF8C0204)));
#define DSGPR0 DSGPR0
extern volatile uint32_t   DSGPR0 __attribute__((section("sfrs"), address(0xBF8C0208)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR0bits_t;
extern volatile __DSGPR0bits_t DSGPR0bits __asm__ ("DSGPR0") __attribute__((section("sfrs"), address(0xBF8C0208)));
#define DSGPR1 DSGPR1
extern volatile uint32_t   DSGPR1 __attribute__((section("sfrs"), address(0xBF8C0210)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR1bits_t;
extern volatile __DSGPR1bits_t DSGPR1bits __asm__ ("DSGPR1") __attribute__((section("sfrs"), address(0xBF8C0210)));
#define DSGPR2 DSGPR2
extern volatile uint32_t   DSGPR2 __attribute__((section("sfrs"), address(0xBF8C0214)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR2bits_t;
extern volatile __DSGPR2bits_t DSGPR2bits __asm__ ("DSGPR2") __attribute__((section("sfrs"), address(0xBF8C0214)));
#define DSGPR3 DSGPR3
extern volatile uint32_t   DSGPR3 __attribute__((section("sfrs"), address(0xBF8C0218)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR3bits_t;
extern volatile __DSGPR3bits_t DSGPR3bits __asm__ ("DSGPR3") __attribute__((section("sfrs"), address(0xBF8C0218)));
#define DSGPR4 DSGPR4
extern volatile uint32_t   DSGPR4 __attribute__((section("sfrs"), address(0xBF8C021C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR4bits_t;
extern volatile __DSGPR4bits_t DSGPR4bits __asm__ ("DSGPR4") __attribute__((section("sfrs"), address(0xBF8C021C)));
#define DSGPR5 DSGPR5
extern volatile uint32_t   DSGPR5 __attribute__((section("sfrs"), address(0xBF8C0220)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR5bits_t;
extern volatile __DSGPR5bits_t DSGPR5bits __asm__ ("DSGPR5") __attribute__((section("sfrs"), address(0xBF8C0220)));
#define DSGPR6 DSGPR6
extern volatile uint32_t   DSGPR6 __attribute__((section("sfrs"), address(0xBF8C0224)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR6bits_t;
extern volatile __DSGPR6bits_t DSGPR6bits __asm__ ("DSGPR6") __attribute__((section("sfrs"), address(0xBF8C0224)));
#define DSGPR7 DSGPR7
extern volatile uint32_t   DSGPR7 __attribute__((section("sfrs"), address(0xBF8C0228)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR7bits_t;
extern volatile __DSGPR7bits_t DSGPR7bits __asm__ ("DSGPR7") __attribute__((section("sfrs"), address(0xBF8C0228)));
#define DSGPR8 DSGPR8
extern volatile uint32_t   DSGPR8 __attribute__((section("sfrs"), address(0xBF8C022C)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR8bits_t;
extern volatile __DSGPR8bits_t DSGPR8bits __asm__ ("DSGPR8") __attribute__((section("sfrs"), address(0xBF8C022C)));
#define DSGPR9 DSGPR9
extern volatile uint32_t   DSGPR9 __attribute__((section("sfrs"), address(0xBF8C0230)));
typedef struct {
  uint32_t DSGPR:32;
} __DSGPR9bits_t;
