Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
  .extern PWMKEY           /* 0xBF82A090 */
  .extern PWMKEYCLR        /* 0xBF82A094 */
  .extern PWMKEYSET        /* 0xBF82A098 */
  .extern PWMKEYINV        /* 0xBF82A09C */
  .extern PWMCON1          /* 0xBF82A0C0 */
  .extern PWMCON1CLR       /* 0xBF82A0C4 */
  .extern PWMCON1SET       /* 0xBF82A0C8 */
  .extern PWMCON1INV       /* 0xBF82A0CC */
  .extern IOCON1           /* 0xBF82A0D0 */
  .extern IOCON1CLR        /* 0xBF82A0D4 */
  .extern IOCON1SET        /* 0xBF82A0D8 */
  .extern IOCON1INV        /* 0xBF82A0DC */
  .extern PDC1             /* 0xBF82A0E0 */
  .extern PDC1CLR          /* 0xBF82A0E4 */
  .extern PDC1SET          /* 0xBF82A0E8 */
  .extern PDC1INV          /* 0xBF82A0EC */
  .extern SDC1             /* 0xBF82A0F0 */
  .extern SDC1CLR          /* 0xBF82A0F4 */
  .extern SDC1SET          /* 0xBF82A0F8 */
  .extern SDC1INV          /* 0xBF82A0FC */
  .extern PHASE1           /* 0xBF82A100 */
  .extern PHASE1CLR        /* 0xBF82A104 */
  .extern PHASE1SET        /* 0xBF82A108 */
  .extern PHASE1INV        /* 0xBF82A10C */
  .extern DTR1             /* 0xBF82A110 */
  .extern DTR1CLR          /* 0xBF82A114 */
  .extern DTR1SET          /* 0xBF82A118 */
  .extern DTR1INV          /* 0xBF82A11C */
  .extern ALTDTR1          /* 0xBF82A120 */
  .extern ALTDTR1CLR       /* 0xBF82A124 */
  .extern ALTDTR1SET       /* 0xBF82A128 */
  .extern ALTDTR1INV       /* 0xBF82A12C */
  .extern DTCOMP1          /* 0xBF82A130 */
  .extern DTCOMP1CLR       /* 0xBF82A134 */
  .extern DTCOMP1SET       /* 0xBF82A138 */
  .extern DTCOMP1INV       /* 0xBF82A13C */
  .extern TRIG1            /* 0xBF82A140 */
  .extern TRIG1CLR         /* 0xBF82A144 */
  .extern TRIG1SET         /* 0xBF82A148 */
  .extern TRIG1INV         /* 0xBF82A14C */
  .extern TRGCON1          /* 0xBF82A150 */
  .extern TRGCON1CLR       /* 0xBF82A154 */
  .extern TRGCON1SET       /* 0xBF82A158 */
  .extern TRGCON1INV       /* 0xBF82A15C */
  .extern STRIG1           /* 0xBF82A160 */
  .extern STRIG1CLR        /* 0xBF82A164 */
  .extern STRIG1SET        /* 0xBF82A168 */
  .extern STRIG1INV        /* 0xBF82A16C */
  .extern CAP1             /* 0xBF82A170 */
  .extern CAP1CLR          /* 0xBF82A174 */
  .extern CAP1SET          /* 0xBF82A178 */
  .extern CAP1INV          /* 0xBF82A17C */
  .extern LEBCON1          /* 0xBF82A180 */
  .extern LEBCON1CLR       /* 0xBF82A184 */
  .extern LEBCON1SET       /* 0xBF82A188 */
  .extern LEBCON1INV       /* 0xBF82A18C */
  .extern LEBDLY1          /* 0xBF82A190 */
  .extern LEBDLY1CLR       /* 0xBF82A194 */
  .extern LEBDLY1SET       /* 0xBF82A198 */
  .extern LEBDLY1INV       /* 0xBF82A19C */
  .extern AUXCON1          /* 0xBF82A1A0 */
  .extern AUXCON1CLR       /* 0xBF82A1A4 */
  .extern AUXCON1SET       /* 0xBF82A1A8 */
  .extern AUXCON1INV       /* 0xBF82A1AC */
  .extern PTMR1            /* 0xBF82A1B0 */
  .extern PTMR1CLR         /* 0xBF82A1B4 */
  .extern PTMR1SET         /* 0xBF82A1B8 */
  .extern PTMR1INV         /* 0xBF82A1BC */
  .extern PWMCON2          /* 0xBF82A1C0 */
  .extern PWMCON2CLR       /* 0xBF82A1C4 */
  .extern PWMCON2SET       /* 0xBF82A1C8 */
  .extern PWMCON2INV       /* 0xBF82A1CC */
  .extern IOCON2           /* 0xBF82A1D0 */
  .extern IOCON2CLR        /* 0xBF82A1D4 */
  .extern IOCON2SET        /* 0xBF82A1D8 */
  .extern IOCON2INV        /* 0xBF82A1DC */
  .extern PDC2             /* 0xBF82A1E0 */
  .extern PDC2CLR          /* 0xBF82A1E4 */
  .extern PDC2SET          /* 0xBF82A1E8 */
  .extern PDC2INV          /* 0xBF82A1EC */
  .extern SDC2             /* 0xBF82A1F0 */
  .extern SDC2CLR          /* 0xBF82A1F4 */
  .extern SDC2SET          /* 0xBF82A1F8 */
  .extern SDC2INV          /* 0xBF82A1FC */
  .extern PHASE2           /* 0xBF82A200 */
  .extern PHASE2CLR        /* 0xBF82A204 */
  .extern PHASE2SET        /* 0xBF82A208 */
  .extern PHASE2INV        /* 0xBF82A20C */
  .extern DTR2             /* 0xBF82A210 */
  .extern DTR2CLR          /* 0xBF82A214 */
  .extern DTR2SET          /* 0xBF82A218 */
  .extern DTR2INV          /* 0xBF82A21C */
  .extern ALTDTR2          /* 0xBF82A220 */
  .extern ALTDTR2CLR       /* 0xBF82A224 */
  .extern ALTDTR2SET       /* 0xBF82A228 */
  .extern ALTDTR2INV       /* 0xBF82A22C */
  .extern DTCOMP2          /* 0xBF82A230 */
  .extern DTCOMP2CLR       /* 0xBF82A234 */
  .extern DTCOMP2SET       /* 0xBF82A238 */
  .extern DTCOMP2INV       /* 0xBF82A23C */
  .extern TRIG2            /* 0xBF82A240 */
  .extern TRIG2CLR         /* 0xBF82A244 */
  .extern TRIG2SET         /* 0xBF82A248 */
  .extern TRIG2INV         /* 0xBF82A24C */
  .extern TRGCON2          /* 0xBF82A250 */
  .extern TRGCON2CLR       /* 0xBF82A254 */
  .extern TRGCON2SET       /* 0xBF82A258 */
  .extern TRGCON2INV       /* 0xBF82A25C */
  .extern STRIG2           /* 0xBF82A260 */
  .extern STRIG2CLR        /* 0xBF82A264 */
  .extern STRIG2SET        /* 0xBF82A268 */
  .extern STRIG2INV        /* 0xBF82A26C */
  .extern CAP2             /* 0xBF82A270 */
  .extern CAP2CLR          /* 0xBF82A274 */
  .extern CAP2SET          /* 0xBF82A278 */
  .extern CAP2INV          /* 0xBF82A27C */
  .extern LEBCON2          /* 0xBF82A280 */
  .extern LEBCON2CLR       /* 0xBF82A284 */
  .extern LEBCON2SET       /* 0xBF82A288 */
  .extern LEBCON2INV       /* 0xBF82A28C */
  .extern LEBDLY2          /* 0xBF82A290 */
  .extern LEBDLY2CLR       /* 0xBF82A294 */
  .extern LEBDLY2SET       /* 0xBF82A298 */
  .extern LEBDLY2INV       /* 0xBF82A29C */
  .extern AUXCON2          /* 0xBF82A2A0 */
  .extern AUXCON2CLR       /* 0xBF82A2A4 */
  .extern AUXCON2SET       /* 0xBF82A2A8 */
  .extern AUXCON2INV       /* 0xBF82A2AC */
  .extern PTMR2            /* 0xBF82A2B0 */
  .extern PTMR2CLR         /* 0xBF82A2B4 */
  .extern PTMR2SET         /* 0xBF82A2B8 */
  .extern PTMR2INV         /* 0xBF82A2BC */
  .extern PWMCON3          /* 0xBF82A2C0 */
  .extern PWMCON3CLR       /* 0xBF82A2C4 */
  .extern PWMCON3SET       /* 0xBF82A2C8 */
  .extern PWMCON3INV       /* 0xBF82A2CC */
  .extern IOCON3           /* 0xBF82A2D0 */
  .extern IOCON3CLR        /* 0xBF82A2D4 */
  .extern IOCON3SET        /* 0xBF82A2D8 */
  .extern IOCON3INV        /* 0xBF82A2DC */
  .extern PDC3             /* 0xBF82A2E0 */
  .extern PDC3CLR          /* 0xBF82A2E4 */
  .extern PDC3SET          /* 0xBF82A2E8 */
  .extern PDC3INV          /* 0xBF82A2EC */
  .extern SDC3             /* 0xBF82A2F0 */
  .extern SDC3CLR          /* 0xBF82A2F4 */
  .extern SDC3SET          /* 0xBF82A2F8 */
  .extern SDC3INV          /* 0xBF82A2FC */
  .extern PHASE3           /* 0xBF82A300 */
  .extern PHASE3CLR        /* 0xBF82A304 */
  .extern PHASE3SET        /* 0xBF82A308 */
  .extern PHASE3INV        /* 0xBF82A30C */
  .extern DTR3             /* 0xBF82A310 */
  .extern DTR3CLR          /* 0xBF82A314 */
  .extern DTR3SET          /* 0xBF82A318 */
  .extern DTR3INV          /* 0xBF82A31C */
  .extern ALTDTR3          /* 0xBF82A320 */
  .extern ALTDTR3CLR       /* 0xBF82A324 */
  .extern ALTDTR3SET       /* 0xBF82A328 */
  .extern ALTDTR3INV       /* 0xBF82A32C */
  .extern DTCOMP3          /* 0xBF82A330 */
  .extern DTCOMP3CLR       /* 0xBF82A334 */
  .extern DTCOMP3SET       /* 0xBF82A338 */
  .extern DTCOMP3INV       /* 0xBF82A33C */
  .extern TRIG3            /* 0xBF82A340 */
  .extern TRIG3CLR         /* 0xBF82A344 */
  .extern TRIG3SET         /* 0xBF82A348 */
  .extern TRIG3INV         /* 0xBF82A34C */
  .extern TRGCON3          /* 0xBF82A350 */
  .extern TRGCON3CLR       /* 0xBF82A354 */
  .extern TRGCON3SET       /* 0xBF82A358 */
  .extern TRGCON3INV       /* 0xBF82A35C */
  .extern STRIG3           /* 0xBF82A360 */
  .extern STRIG3CLR        /* 0xBF82A364 */
  .extern STRIG3SET        /* 0xBF82A368 */
  .extern STRIG3INV        /* 0xBF82A36C */
  .extern CAP3             /* 0xBF82A370 */
  .extern CAP3CLR          /* 0xBF82A374 */
  .extern CAP3SET          /* 0xBF82A378 */
  .extern CAP3INV          /* 0xBF82A37C */
  .extern LEBCON3          /* 0xBF82A380 */
  .extern LEBCON3CLR       /* 0xBF82A384 */
  .extern LEBCON3SET       /* 0xBF82A388 */
  .extern LEBCON3INV       /* 0xBF82A38C */
  .extern LEBDLY3          /* 0xBF82A390 */
  .extern LEBDLY3CLR       /* 0xBF82A394 */
  .extern LEBDLY3SET       /* 0xBF82A398 */
  .extern LEBDLY3INV       /* 0xBF82A39C */
  .extern AUXCON3          /* 0xBF82A3A0 */
  .extern AUXCON3CLR       /* 0xBF82A3A4 */
  .extern AUXCON3SET       /* 0xBF82A3A8 */
  .extern AUXCON3INV       /* 0xBF82A3AC */
  .extern PTMR3            /* 0xBF82A3B0 */
  .extern PTMR3CLR         /* 0xBF82A3B4 */
  .extern PTMR3SET         /* 0xBF82A3B8 */
  .extern PTMR3INV         /* 0xBF82A3BC */
  .extern PWMCON4          /* 0xBF82A3C0 */
  .extern PWMCON4CLR       /* 0xBF82A3C4 */
  .extern PWMCON4SET       /* 0xBF82A3C8 */
  .extern PWMCON4INV       /* 0xBF82A3CC */
  .extern IOCON4           /* 0xBF82A3D0 */
  .extern IOCON4CLR        /* 0xBF82A3D4 */
  .extern IOCON4SET        /* 0xBF82A3D8 */
  .extern IOCON4INV        /* 0xBF82A3DC */
  .extern PDC4             /* 0xBF82A3E0 */
  .extern PDC4CLR          /* 0xBF82A3E4 */
  .extern PDC4SET          /* 0xBF82A3E8 */
  .extern PDC4INV          /* 0xBF82A3EC */
  .extern SDC4             /* 0xBF82A3F0 */
  .extern SDC4CLR          /* 0xBF82A3F4 */
  .extern SDC4SET          /* 0xBF82A3F8 */
  .extern SDC4INV          /* 0xBF82A3FC */
  .extern PHASE4           /* 0xBF82A400 */
  .extern PHASE4CLR        /* 0xBF82A404 */
  .extern PHASE4SET        /* 0xBF82A408 */
  .extern PHASE4INV        /* 0xBF82A40C */
  .extern DTR4             /* 0xBF82A410 */
  .extern DTR4CLR          /* 0xBF82A414 */
  .extern DTR4SET          /* 0xBF82A418 */
  .extern DTR4INV          /* 0xBF82A41C */
  .extern ALTDTR4          /* 0xBF82A420 */
  .extern ALTDTR4CLR       /* 0xBF82A424 */
  .extern ALTDTR4SET       /* 0xBF82A428 */
  .extern ALTDTR4INV       /* 0xBF82A42C */
  .extern DTCOMP4          /* 0xBF82A430 */
  .extern DTCOMP4CLR       /* 0xBF82A434 */
  .extern DTCOMP4SET       /* 0xBF82A438 */
  .extern DTCOMP4INV       /* 0xBF82A43C */
  .extern TRIG4            /* 0xBF82A440 */
  .extern TRIG4CLR         /* 0xBF82A444 */
  .extern TRIG4SET         /* 0xBF82A448 */
  .extern TRIG4INV         /* 0xBF82A44C */
  .extern TRGCON4          /* 0xBF82A450 */
  .extern TRGCON4CLR       /* 0xBF82A454 */
  .extern TRGCON4SET       /* 0xBF82A458 */
  .extern TRGCON4INV       /* 0xBF82A45C */
  .extern STRIG4           /* 0xBF82A460 */
  .extern STRIG4CLR        /* 0xBF82A464 */
  .extern STRIG4SET        /* 0xBF82A468 */
  .extern STRIG4INV        /* 0xBF82A46C */
  .extern CAP4             /* 0xBF82A470 */
  .extern CAP4CLR          /* 0xBF82A474 */
  .extern CAP4SET          /* 0xBF82A478 */
  .extern CAP4INV          /* 0xBF82A47C */
  .extern LEBCON4          /* 0xBF82A480 */
  .extern LEBCON4CLR       /* 0xBF82A484 */
  .extern LEBCON4SET       /* 0xBF82A488 */
  .extern LEBCON4INV       /* 0xBF82A48C */
  .extern LEBDLY4          /* 0xBF82A490 */
  .extern LEBDLY4CLR       /* 0xBF82A494 */
  .extern LEBDLY4SET       /* 0xBF82A498 */
  .extern LEBDLY4INV       /* 0xBF82A49C */
  .extern AUXCON4          /* 0xBF82A4A0 */
  .extern AUXCON4CLR       /* 0xBF82A4A4 */
  .extern AUXCON4SET       /* 0xBF82A4A8 */
  .extern AUXCON4INV       /* 0xBF82A4AC */
  .extern PTMR4            /* 0xBF82A4B0 */
  .extern PTMR4CLR         /* 0xBF82A4B4 */
  .extern PTMR4SET         /* 0xBF82A4B8 */
  .extern PTMR4INV         /* 0xBF82A4BC */
  .extern PWMCON5          /* 0xBF82A4C0 */
  .extern PWMCON5CLR       /* 0xBF82A4C4 */
  .extern PWMCON5SET       /* 0xBF82A4C8 */
  .extern PWMCON5INV       /* 0xBF82A4CC */
  .extern IOCON5           /* 0xBF82A4D0 */
  .extern IOCON5CLR        /* 0xBF82A4D4 */
  .extern IOCON5SET        /* 0xBF82A4D8 */
  .extern IOCON5INV        /* 0xBF82A4DC */
  .extern PDC5             /* 0xBF82A4E0 */
  .extern PDC5CLR          /* 0xBF82A4E4 */
  .extern PDC5SET          /* 0xBF82A4E8 */
  .extern PDC5INV          /* 0xBF82A4EC */
  .extern SDC5             /* 0xBF82A4F0 */
  .extern SDC5CLR          /* 0xBF82A4F4 */
  .extern SDC5SET          /* 0xBF82A4F8 */
  .extern SDC5INV          /* 0xBF82A4FC */
  .extern PHASE5           /* 0xBF82A500 */
  .extern PHASE5CLR        /* 0xBF82A504 */
  .extern PHASE5SET        /* 0xBF82A508 */
  .extern PHASE5INV        /* 0xBF82A50C */
  .extern DTR5             /* 0xBF82A510 */
  .extern DTR5CLR          /* 0xBF82A514 */
  .extern DTR5SET          /* 0xBF82A518 */
  .extern DTR5INV          /* 0xBF82A51C */
  .extern ALTDTR5          /* 0xBF82A520 */
  .extern ALTDTR5CLR       /* 0xBF82A524 */
  .extern ALTDTR5SET       /* 0xBF82A528 */
  .extern ALTDTR5INV       /* 0xBF82A52C */
  .extern DTCOMP5          /* 0xBF82A530 */
  .extern DTCOMP5CLR       /* 0xBF82A534 */
  .extern DTCOMP5SET       /* 0xBF82A538 */
  .extern DTCOMP5INV       /* 0xBF82A53C */
  .extern TRIG5            /* 0xBF82A540 */
  .extern TRIG5CLR         /* 0xBF82A544 */
  .extern TRIG5SET         /* 0xBF82A548 */
  .extern TRIG5INV         /* 0xBF82A54C */
  .extern TRGCON5          /* 0xBF82A550 */
  .extern TRGCON5CLR       /* 0xBF82A554 */
  .extern TRGCON5SET       /* 0xBF82A558 */
  .extern TRGCON5INV       /* 0xBF82A55C */
  .extern STRIG5           /* 0xBF82A560 */
  .extern STRIG5CLR        /* 0xBF82A564 */
  .extern STRIG5SET        /* 0xBF82A568 */
  .extern STRIG5INV        /* 0xBF82A56C */
  .extern CAP5             /* 0xBF82A570 */
  .extern CAP5CLR          /* 0xBF82A574 */
  .extern CAP5SET          /* 0xBF82A578 */
  .extern CAP5INV          /* 0xBF82A57C */
  .extern LEBCON5          /* 0xBF82A580 */
  .extern LEBCON5CLR       /* 0xBF82A584 */
  .extern LEBCON5SET       /* 0xBF82A588 */
  .extern LEBCON5INV       /* 0xBF82A58C */
  .extern LEBDLY5          /* 0xBF82A590 */
  .extern LEBDLY5CLR       /* 0xBF82A594 */
  .extern LEBDLY5SET       /* 0xBF82A598 */
  .extern LEBDLY5INV       /* 0xBF82A59C */
  .extern AUXCON5          /* 0xBF82A5A0 */
  .extern AUXCON5CLR       /* 0xBF82A5A4 */
  .extern AUXCON5SET       /* 0xBF82A5A8 */
  .extern AUXCON5INV       /* 0xBF82A5AC */
  .extern PTMR5            /* 0xBF82A5B0 */
  .extern PTMR5CLR         /* 0xBF82A5B4 */
  .extern PTMR5SET         /* 0xBF82A5B8 */
  .extern PTMR5INV         /* 0xBF82A5BC */
  .extern PWMCON6          /* 0xBF82A5C0 */
  .extern PWMCON6CLR       /* 0xBF82A5C4 */
  .extern PWMCON6SET       /* 0xBF82A5C8 */
  .extern PWMCON6INV       /* 0xBF82A5CC */
  .extern IOCON6           /* 0xBF82A5D0 */
  .extern IOCON6CLR        /* 0xBF82A5D4 */
  .extern IOCON6SET        /* 0xBF82A5D8 */
  .extern IOCON6INV        /* 0xBF82A5DC */
  .extern PDC6             /* 0xBF82A5E0 */
  .extern PDC6CLR          /* 0xBF82A5E4 */
  .extern PDC6SET          /* 0xBF82A5E8 */
  .extern PDC6INV          /* 0xBF82A5EC */
  .extern SDC6             /* 0xBF82A5F0 */
  .extern SDC6CLR          /* 0xBF82A5F4 */
  .extern SDC6SET          /* 0xBF82A5F8 */
  .extern SDC6INV          /* 0xBF82A5FC */
  .extern PHASE6           /* 0xBF82A600 */
  .extern PHASE6CLR        /* 0xBF82A604 */
  .extern PHASE6SET        /* 0xBF82A608 */
  .extern PHASE6INV        /* 0xBF82A60C */
  .extern DTR6             /* 0xBF82A610 */
  .extern DTR6CLR          /* 0xBF82A614 */
  .extern DTR6SET          /* 0xBF82A618 */
  .extern DTR6INV          /* 0xBF82A61C */
  .extern ALTDTR6          /* 0xBF82A620 */
  .extern ALTDTR6CLR       /* 0xBF82A624 */
  .extern ALTDTR6SET       /* 0xBF82A628 */
  .extern ALTDTR6INV       /* 0xBF82A62C */
  .extern DTCOMP6          /* 0xBF82A630 */
  .extern DTCOMP6CLR       /* 0xBF82A634 */
  .extern DTCOMP6SET       /* 0xBF82A638 */
  .extern DTCOMP6INV       /* 0xBF82A63C */
  .extern TRIG6            /* 0xBF82A640 */
  .extern TRIG6CLR         /* 0xBF82A644 */
  .extern TRIG6SET         /* 0xBF82A648 */
  .extern TRIG6INV         /* 0xBF82A64C */
  .extern TRGCON6          /* 0xBF82A650 */
  .extern TRGCON6CLR       /* 0xBF82A654 */
  .extern TRGCON6SET       /* 0xBF82A658 */
  .extern TRGCON6INV       /* 0xBF82A65C */
  .extern STRIG6           /* 0xBF82A660 */
  .extern STRIG6CLR        /* 0xBF82A664 */
  .extern STRIG6SET        /* 0xBF82A668 */
  .extern STRIG6INV        /* 0xBF82A66C */
  .extern CAP6             /* 0xBF82A670 */
  .extern CAP6CLR          /* 0xBF82A674 */
  .extern CAP6SET          /* 0xBF82A678 */
  .extern CAP6INV          /* 0xBF82A67C */
  .extern LEBCON6          /* 0xBF82A680 */
  .extern LEBCON6CLR       /* 0xBF82A684 */
  .extern LEBCON6SET       /* 0xBF82A688 */
  .extern LEBCON6INV       /* 0xBF82A68C */
  .extern LEBDLY6          /* 0xBF82A690 */
  .extern LEBDLY6CLR       /* 0xBF82A694 */
  .extern LEBDLY6SET       /* 0xBF82A698 */
  .extern LEBDLY6INV       /* 0xBF82A69C */
  .extern AUXCON6          /* 0xBF82A6A0 */
  .extern AUXCON6CLR       /* 0xBF82A6A4 */
  .extern AUXCON6SET       /* 0xBF82A6A8 */
  .extern AUXCON6INV       /* 0xBF82A6AC */
  .extern PTMR6            /* 0xBF82A6B0 */
  .extern PTMR6CLR         /* 0xBF82A6B4 */
  .extern PTMR6SET         /* 0xBF82A6B8 */
  .extern PTMR6INV         /* 0xBF82A6BC */
  .extern QEI1CON          /* 0xBF82B200 */
  .extern QEI1CONCLR       /* 0xBF82B204 */
  .extern QEI1CONSET       /* 0xBF82B208 */
  .extern QEI1CONINV       /* 0xBF82B20C */
  .extern QEI1IOC          /* 0xBF82B210 */
  .extern QEI1IOCCLR       /* 0xBF82B214 */
  .extern QEI1IOCSET       /* 0xBF82B218 */
  .extern QEI1IOCINV       /* 0xBF82B21C */
  .extern QEI1STAT         /* 0xBF82B220 */
  .extern QEI1STATCLR      /* 0xBF82B224 */
  .extern QEI1STATSET      /* 0xBF82B228 */
  .extern QEI1STATINV      /* 0xBF82B22C */
  .extern POS1CNT          /* 0xBF82B230 */
  .extern POS1CNTCLR       /* 0xBF82B234 */
  .extern POS1CNTSET       /* 0xBF82B238 */
  .extern POS1CNTINV       /* 0xBF82B23C */
  .extern POS1HLD          /* 0xBF82B240 */
  .extern POS1HLDCLR       /* 0xBF82B244 */
  .extern POS1HLDSET       /* 0xBF82B248 */
  .extern POS1HLDINV       /* 0xBF82B24C */
  .extern VEL1CNT          /* 0xBF82B250 */
  .extern VEL1CNTCLR       /* 0xBF82B254 */
  .extern VEL1CNTSET       /* 0xBF82B258 */
  .extern VEL1CNTINV       /* 0xBF82B25C */
  .extern VEL1HLD          /* 0xBF82B260 */
  .extern VEL1HLDCLR       /* 0xBF82B264 */
  .extern VEL1HLDSET       /* 0xBF82B268 */
  .extern VEL1HLDINV       /* 0xBF82B26C */
  .extern INT1TMR          /* 0xBF82B270 */
  .extern INT1TMRCLR       /* 0xBF82B274 */
  .extern INT1TMRSET       /* 0xBF82B278 */
  .extern INT1TMRINV       /* 0xBF82B27C */
  .extern INT1HLD          /* 0xBF82B280 */
  .extern INT1HLDCLR       /* 0xBF82B284 */
  .extern INT1HLDSET       /* 0xBF82B288 */
  .extern INT1HLDINV       /* 0xBF82B28C */
  .extern INDX1CNT         /* 0xBF82B290 */
  .extern INDX1CNTCLR      /* 0xBF82B294 */
  .extern INDX1CNTSET      /* 0xBF82B298 */
  .extern INDX1CNTINV      /* 0xBF82B29C */
  .extern INDX1HLD         /* 0xBF82B2A0 */
  .extern INDX1HLDCLR      /* 0xBF82B2A4 */
  .extern INDX1HLDSET      /* 0xBF82B2A8 */
  .extern INDX1HLDINV      /* 0xBF82B2AC */
  .extern QEI1ICC          /* 0xBF82B2B0 */
  .extern QEI1ICCCLR       /* 0xBF82B2B4 */
  .extern QEI1ICCSET       /* 0xBF82B2B8 */
  .extern QEI1ICCINV       /* 0xBF82B2BC */
  .extern QEI1CMPL         /* 0xBF82B2C0 */
  .extern QEI1CMPLCLR      /* 0xBF82B2C4 */
  .extern QEI1CMPLSET      /* 0xBF82B2C8 */
  .extern QEI1CMPLINV      /* 0xBF82B2CC */
  .extern QEI2CON          /* 0xBF82B400 */
  .extern QEI2CONCLR       /* 0xBF82B404 */
  .extern QEI2CONSET       /* 0xBF82B408 */
  .extern QEI2CONINV       /* 0xBF82B40C */
  .extern QEI2IOC          /* 0xBF82B410 */
  .extern QEI2IOCCLR       /* 0xBF82B414 */
  .extern QEI2IOCSET       /* 0xBF82B418 */
  .extern QEI2IOCINV       /* 0xBF82B41C */
  .extern QEI2STAT         /* 0xBF82B420 */
  .extern QEI2STATCLR      /* 0xBF82B424 */
  .extern QEI2STATSET      /* 0xBF82B428 */
  .extern QEI2STATINV      /* 0xBF82B42C */
  .extern POS2CNT          /* 0xBF82B430 */
  .extern POS2CNTCLR       /* 0xBF82B434 */
  .extern POS2CNTSET       /* 0xBF82B438 */
  .extern POS2CNTINV       /* 0xBF82B43C */
  .extern POS2HLD          /* 0xBF82B440 */
  .extern POS2HLDCLR       /* 0xBF82B444 */
  .extern POS2HLDSET       /* 0xBF82B448 */
  .extern POS2HLDINV       /* 0xBF82B44C */
  .extern VEL2CNT          /* 0xBF82B450 */
  .extern VEL2CNTCLR       /* 0xBF82B454 */
  .extern VEL2CNTSET       /* 0xBF82B458 */
  .extern VEL2CNTINV       /* 0xBF82B45C */
  .extern VEL2HLD          /* 0xBF82B460 */
  .extern VEL2HLDCLR       /* 0xBF82B464 */
  .extern VEL2HLDSET       /* 0xBF82B468 */
  .extern VEL2HLDINV       /* 0xBF82B46C */
  .extern INT2TMR          /* 0xBF82B470 */
  .extern INT2TMRCLR       /* 0xBF82B474 */
  .extern INT2TMRSET       /* 0xBF82B478 */
  .extern INT2TMRINV       /* 0xBF82B47C */
  .extern INT2HLD          /* 0xBF82B480 */
  .extern INT2HLDCLR       /* 0xBF82B484 */
  .extern INT2HLDSET       /* 0xBF82B488 */
  .extern INT2HLDINV       /* 0xBF82B48C */
  .extern INDX2CNT         /* 0xBF82B490 */
  .extern INDX2CNTCLR      /* 0xBF82B494 */
  .extern INDX2CNTSET      /* 0xBF82B498 */
  .extern INDX2CNTINV      /* 0xBF82B49C */
  .extern INDX2HLD         /* 0xBF82B4A0 */
  .extern INDX2HLDCLR      /* 0xBF82B4A4 */
  .extern INDX2HLDSET      /* 0xBF82B4A8 */
  .extern INDX2HLDINV      /* 0xBF82B4AC */
  .extern QEI2ICC          /* 0xBF82B4B0 */
  .extern QEI2ICCCLR       /* 0xBF82B4B4 */
  .extern QEI2ICCSET       /* 0xBF82B4B8 */
  .extern QEI2ICCINV       /* 0xBF82B4BC */
  .extern QEI2CMPL         /* 0xBF82B4C0 */
  .extern QEI2CMPLCLR      /* 0xBF82B4C4 */
  .extern QEI2CMPLSET      /* 0xBF82B4C8 */
  .extern QEI2CMPLINV      /* 0xBF82B4CC */
  .extern QEI3CON          /* 0xBF82B600 */
  .extern QEI3CONCLR       /* 0xBF82B604 */
  .extern QEI3CONSET       /* 0xBF82B608 */
  .extern QEI3CONINV       /* 0xBF82B60C */
  .extern QEI3IOC          /* 0xBF82B610 */
  .extern QEI3IOCCLR       /* 0xBF82B614 */
  .extern QEI3IOCSET       /* 0xBF82B618 */
  .extern QEI3IOCINV       /* 0xBF82B61C */
  .extern QEI3STAT         /* 0xBF82B620 */
  .extern QEI3STATCLR      /* 0xBF82B624 */
  .extern QEI3STATSET      /* 0xBF82B628 */
  .extern QEI3STATINV      /* 0xBF82B62C */
  .extern POS3CNT          /* 0xBF82B630 */
  .extern POS3CNTCLR       /* 0xBF82B634 */
  .extern POS3CNTSET       /* 0xBF82B638 */
  .extern POS3CNTINV       /* 0xBF82B63C */
  .extern POS3HLD          /* 0xBF82B640 */
  .extern POS3HLDCLR       /* 0xBF82B644 */
  .extern POS3HLDSET       /* 0xBF82B648 */
  .extern POS3HLDINV       /* 0xBF82B64C */
  .extern VEL3CNT          /* 0xBF82B650 */
  .extern VEL3CNTCLR       /* 0xBF82B654 */
  .extern VEL3CNTSET       /* 0xBF82B658 */
  .extern VEL3CNTINV       /* 0xBF82B65C */
  .extern VEL3HLD          /* 0xBF82B660 */
  .extern VEL3HLDCLR       /* 0xBF82B664 */
  .extern VEL3HLDSET       /* 0xBF82B668 */
  .extern VEL3HLDINV       /* 0xBF82B66C */
  .extern INT3TMR          /* 0xBF82B670 */
  .extern INT3TMRCLR       /* 0xBF82B674 */
  .extern INT3TMRSET       /* 0xBF82B678 */
  .extern INT3TMRINV       /* 0xBF82B67C */
  .extern INT3HLD          /* 0xBF82B680 */
  .extern INT3HLDCLR       /* 0xBF82B684 */
  .extern INT3HLDSET       /* 0xBF82B688 */
  .extern INT3HLDINV       /* 0xBF82B68C */
  .extern INDX3CNT         /* 0xBF82B690 */
  .extern INDX3CNTCLR      /* 0xBF82B694 */
  .extern INDX3CNTSET      /* 0xBF82B698 */
  .extern INDX3CNTINV      /* 0xBF82B69C */
  .extern INDX3HLD         /* 0xBF82B6A0 */
  .extern INDX3HLDCLR      /* 0xBF82B6A4 */
  .extern INDX3HLDSET      /* 0xBF82B6A8 */
  .extern INDX3HLDINV      /* 0xBF82B6AC */
  .extern QEI3ICC          /* 0xBF82B6B0 */
  .extern QEI3ICCCLR       /* 0xBF82B6B4 */
  .extern QEI3ICCSET       /* 0xBF82B6B8 */
  .extern QEI3ICCINV       /* 0xBF82B6BC */
  .extern QEI3CMPL         /* 0xBF82B6C0 */
  .extern QEI3CMPLCLR      /* 0xBF82B6C4 */
  .extern QEI3CMPLSET      /* 0xBF82B6C8 */
  .extern QEI3CMPLINV      /* 0xBF82B6CC */
  .extern CMSTAT           /* 0xBF82C000 */
