Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
  .extern CMSTATCLR        /* 0xBF82C004 */
  .extern CMSTATSET        /* 0xBF82C008 */
  .extern CMSTATINV        /* 0xBF82C00C */
  .extern CM1CON           /* 0xBF82C010 */
  .extern CM1CONCLR        /* 0xBF82C014 */
  .extern CM1CONSET        /* 0xBF82C018 */
  .extern CM1CONINV        /* 0xBF82C01C */
  .extern CM1MSKCON        /* 0xBF82C020 */
  .extern CM1MSKCONCLR     /* 0xBF82C024 */
  .extern CM1MSKCONSET     /* 0xBF82C028 */
  .extern CM1MSKCONINV     /* 0xBF82C02C */
  .extern CM2CON           /* 0xBF82C030 */
  .extern CM2CONCLR        /* 0xBF82C034 */
  .extern CM2CONSET        /* 0xBF82C038 */
  .extern CM2CONINV        /* 0xBF82C03C */
  .extern CM2MSKCON        /* 0xBF82C040 */
  .extern CM2MSKCONCLR     /* 0xBF82C044 */
  .extern CM2MSKCONSET     /* 0xBF82C048 */
  .extern CM2MSKCONINV     /* 0xBF82C04C */
  .extern CM3CON           /* 0xBF82C050 */
  .extern CM3CONCLR        /* 0xBF82C054 */
  .extern CM3CONSET        /* 0xBF82C058 */
  .extern CM3CONINV        /* 0xBF82C05C */
  .extern CM3MSKCON        /* 0xBF82C060 */
  .extern CM3MSKCONCLR     /* 0xBF82C064 */
  .extern CM3MSKCONSET     /* 0xBF82C068 */
  .extern CM3MSKCONINV     /* 0xBF82C06C */
  .extern CM4CON           /* 0xBF82C070 */
  .extern CM4CONCLR        /* 0xBF82C074 */
  .extern CM4CONSET        /* 0xBF82C078 */
  .extern CM4CONINV        /* 0xBF82C07C */
  .extern CM4MSKCON        /* 0xBF82C080 */
  .extern CM4MSKCONCLR     /* 0xBF82C084 */
  .extern CM4MSKCONSET     /* 0xBF82C088 */
  .extern CM4MSKCONINV     /* 0xBF82C08C */
  .extern CM5CON           /* 0xBF82C090 */
  .extern CM5CONCLR        /* 0xBF82C094 */
  .extern CM5CONSET        /* 0xBF82C098 */
  .extern CM5CONINV        /* 0xBF82C09C */
  .extern CM5MSKCON        /* 0xBF82C0A0 */
  .extern CM5MSKCONCLR     /* 0xBF82C0A4 */
  .extern CM5MSKCONSET     /* 0xBF82C0A8 */
  .extern CM5MSKCONINV     /* 0xBF82C0AC */
  .extern DAC1CON          /* 0xBF82C400 */
  .extern DAC1CONCLR       /* 0xBF82C404 */
  .extern DAC1CONSET       /* 0xBF82C408 */
  .extern DAC1CONINV       /* 0xBF82C40C */
  .extern DAC2CON          /* 0xBF82C600 */
  .extern DAC2CONCLR       /* 0xBF82C604 */
  .extern DAC2CONSET       /* 0xBF82C608 */
  .extern DAC2CONINV       /* 0xBF82C60C */
  .extern CTMUCON          /* 0xBF82D000 */
  .extern CTMUCONCLR       /* 0xBF82D004 */
  .extern CTMUCONSET       /* 0xBF82D008 */
  .extern CTMUCONINV       /* 0xBF82D00C */
  .extern CLC1CON          /* 0xBF82D200 */
  .extern CLC1CONCLR       /* 0xBF82D204 */
  .extern CLC1CONSET       /* 0xBF82D208 */
  .extern CLC1CONINV       /* 0xBF82D20C */
  .extern CLC1SEL          /* 0xBF82D210 */
  .extern CLC1SELCLR       /* 0xBF82D214 */
  .extern CLC1SELSET       /* 0xBF82D218 */
  .extern CLC1SELINV       /* 0xBF82D21C */
  .extern CLC1GLS          /* 0xBF82D220 */
  .extern CLC1GLSCLR       /* 0xBF82D224 */
  .extern CLC1GLSSET       /* 0xBF82D228 */
  .extern CLC1GLSINV       /* 0xBF82D22C */
  .extern CLC2CON          /* 0xBF82D400 */
  .extern CLC2CONCLR       /* 0xBF82D404 */
  .extern CLC2CONSET       /* 0xBF82D408 */
  .extern CLC2CONINV       /* 0xBF82D40C */
  .extern CLC2SEL          /* 0xBF82D410 */
  .extern CLC2SELCLR       /* 0xBF82D414 */
  .extern CLC2SELSET       /* 0xBF82D418 */
  .extern CLC2SELINV       /* 0xBF82D41C */
  .extern CLC2GLS          /* 0xBF82D420 */
  .extern CLC2GLSCLR       /* 0xBF82D424 */
  .extern CLC2GLSSET       /* 0xBF82D428 */
  .extern CLC2GLSINV       /* 0xBF82D42C */
  .extern CLC3CON          /* 0xBF82D600 */
  .extern CLC3CONCLR       /* 0xBF82D604 */
  .extern CLC3CONSET       /* 0xBF82D608 */
  .extern CLC3CONINV       /* 0xBF82D60C */
  .extern CLC3SEL          /* 0xBF82D610 */
  .extern CLC3SELCLR       /* 0xBF82D614 */
  .extern CLC3SELSET       /* 0xBF82D618 */
  .extern CLC3SELINV       /* 0xBF82D61C */
  .extern CLC3GLS          /* 0xBF82D620 */
  .extern CLC3GLSCLR       /* 0xBF82D624 */
  .extern CLC3GLSSET       /* 0xBF82D628 */
  .extern CLC3GLSINV       /* 0xBF82D62C */
  .extern CLC4CON          /* 0xBF82D800 */
  .extern CLC4CONCLR       /* 0xBF82D804 */
  .extern CLC4CONSET       /* 0xBF82D808 */
  .extern CLC4CONINV       /* 0xBF82D80C */
  .extern CLC4SEL          /* 0xBF82D810 */
  .extern CLC4SELCLR       /* 0xBF82D814 */
  .extern CLC4SELSET       /* 0xBF82D818 */
  .extern CLC4SELINV       /* 0xBF82D81C */
  .extern CLC4GLS          /* 0xBF82D820 */
  .extern CLC4GLSCLR       /* 0xBF82D824 */
  .extern CLC4GLSSET       /* 0xBF82D828 */
  .extern CLC4GLSINV       /* 0xBF82D82C */
  .extern ANSELA           /* 0xBF860000 */
  .extern ANSELACLR        /* 0xBF860004 */
  .extern ANSELASET        /* 0xBF860008 */
  .extern ANSELAINV        /* 0xBF86000C */
  .extern TRISA            /* 0xBF860010 */
  .extern TRISACLR         /* 0xBF860014 */
  .extern TRISASET         /* 0xBF860018 */
  .extern TRISAINV         /* 0xBF86001C */
  .extern PORTA            /* 0xBF860020 */
  .extern PORTACLR         /* 0xBF860024 */
  .extern PORTASET         /* 0xBF860028 */
  .extern PORTAINV         /* 0xBF86002C */
  .extern LATA             /* 0xBF860030 */
  .extern LATACLR          /* 0xBF860034 */
  .extern LATASET          /* 0xBF860038 */
  .extern LATAINV          /* 0xBF86003C */
  .extern ODCA             /* 0xBF860040 */
  .extern ODCACLR          /* 0xBF860044 */
  .extern ODCASET          /* 0xBF860048 */
  .extern ODCAINV          /* 0xBF86004C */
  .extern CNPUA            /* 0xBF860050 */
  .extern CNPUACLR         /* 0xBF860054 */
  .extern CNPUASET         /* 0xBF860058 */
  .extern CNPUAINV         /* 0xBF86005C */
  .extern CNPDA            /* 0xBF860060 */
  .extern CNPDACLR         /* 0xBF860064 */
  .extern CNPDASET         /* 0xBF860068 */
  .extern CNPDAINV         /* 0xBF86006C */
  .extern CNCONA           /* 0xBF860070 */
  .extern CNCONACLR        /* 0xBF860074 */
  .extern CNCONASET        /* 0xBF860078 */
  .extern CNCONAINV        /* 0xBF86007C */
  .extern CNENA            /* 0xBF860080 */
  .extern CNENACLR         /* 0xBF860084 */
  .extern CNENASET         /* 0xBF860088 */
  .extern CNENAINV         /* 0xBF86008C */
  .extern CNSTATA          /* 0xBF860090 */
  .extern CNSTATACLR       /* 0xBF860094 */
  .extern CNSTATASET       /* 0xBF860098 */
  .extern CNSTATAINV       /* 0xBF86009C */
  .extern CNNEA            /* 0xBF8600A0 */
  .extern CNNEACLR         /* 0xBF8600A4 */
  .extern CNNEASET         /* 0xBF8600A8 */
  .extern CNNEAINV         /* 0xBF8600AC */
  .extern CNFA             /* 0xBF8600B0 */
  .extern CNFACLR          /* 0xBF8600B4 */
  .extern CNFASET          /* 0xBF8600B8 */
  .extern CNFAINV          /* 0xBF8600BC */
  .extern SRCON0A          /* 0xBF8600C0 */
  .extern SRCON0ACLR       /* 0xBF8600C4 */
  .extern SRCON0ASET       /* 0xBF8600C8 */
  .extern SRCON0AINV       /* 0xBF8600CC */
  .extern SRCON1A          /* 0xBF8600D0 */
  .extern SRCON1ACLR       /* 0xBF8600D4 */
  .extern SRCON1ASET       /* 0xBF8600D8 */
  .extern SRCON1AINV       /* 0xBF8600DC */
  .extern ANSELB           /* 0xBF860100 */
  .extern ANSELBCLR        /* 0xBF860104 */
  .extern ANSELBSET        /* 0xBF860108 */
  .extern ANSELBINV        /* 0xBF86010C */
  .extern TRISB            /* 0xBF860110 */
  .extern TRISBCLR         /* 0xBF860114 */
  .extern TRISBSET         /* 0xBF860118 */
  .extern TRISBINV         /* 0xBF86011C */
  .extern PORTB            /* 0xBF860120 */
  .extern PORTBCLR         /* 0xBF860124 */
  .extern PORTBSET         /* 0xBF860128 */
  .extern PORTBINV         /* 0xBF86012C */
  .extern LATB             /* 0xBF860130 */
  .extern LATBCLR          /* 0xBF860134 */
  .extern LATBSET          /* 0xBF860138 */
  .extern LATBINV          /* 0xBF86013C */
  .extern ODCB             /* 0xBF860140 */
  .extern ODCBCLR          /* 0xBF860144 */
  .extern ODCBSET          /* 0xBF860148 */
  .extern ODCBINV          /* 0xBF86014C */
  .extern CNPUB            /* 0xBF860150 */
  .extern CNPUBCLR         /* 0xBF860154 */
  .extern CNPUBSET         /* 0xBF860158 */
  .extern CNPUBINV         /* 0xBF86015C */
  .extern CNPDB            /* 0xBF860160 */
  .extern CNPDBCLR         /* 0xBF860164 */
  .extern CNPDBSET         /* 0xBF860168 */
  .extern CNPDBINV         /* 0xBF86016C */
  .extern CNCONB           /* 0xBF860170 */
  .extern CNCONBCLR        /* 0xBF860174 */
  .extern CNCONBSET        /* 0xBF860178 */
  .extern CNCONBINV        /* 0xBF86017C */
  .extern CNENB            /* 0xBF860180 */
  .extern CNENBCLR         /* 0xBF860184 */
  .extern CNENBSET         /* 0xBF860188 */
  .extern CNENBINV         /* 0xBF86018C */
  .extern CNSTATB          /* 0xBF860190 */
  .extern CNSTATBCLR       /* 0xBF860194 */
  .extern CNSTATBSET       /* 0xBF860198 */
  .extern CNSTATBINV       /* 0xBF86019C */
  .extern CNNEB            /* 0xBF8601A0 */
  .extern CNNEBCLR         /* 0xBF8601A4 */
  .extern CNNEBSET         /* 0xBF8601A8 */
  .extern CNNEBINV         /* 0xBF8601AC */
  .extern CNFB             /* 0xBF8601B0 */
  .extern CNFBCLR          /* 0xBF8601B4 */
  .extern CNFBSET          /* 0xBF8601B8 */
  .extern CNFBINV          /* 0xBF8601BC */
  .extern SRCON0B          /* 0xBF8601C0 */
  .extern SRCON0BCLR       /* 0xBF8601C4 */
  .extern SRCON0BSET       /* 0xBF8601C8 */
  .extern SRCON0BINV       /* 0xBF8601CC */
  .extern SRCON1B          /* 0xBF8601D0 */
  .extern SRCON1BCLR       /* 0xBF8601D4 */
  .extern SRCON1BSET       /* 0xBF8601D8 */
  .extern SRCON1BINV       /* 0xBF8601DC */
  .extern ANSELC           /* 0xBF860200 */
  .extern ANSELCCLR        /* 0xBF860204 */
  .extern ANSELCSET        /* 0xBF860208 */
  .extern ANSELCINV        /* 0xBF86020C */
  .extern TRISC            /* 0xBF860210 */
  .extern TRISCCLR         /* 0xBF860214 */
  .extern TRISCSET         /* 0xBF860218 */
  .extern TRISCINV         /* 0xBF86021C */
  .extern PORTC            /* 0xBF860220 */
  .extern PORTCCLR         /* 0xBF860224 */
  .extern PORTCSET         /* 0xBF860228 */
  .extern PORTCINV         /* 0xBF86022C */
  .extern LATC             /* 0xBF860230 */
  .extern LATCCLR          /* 0xBF860234 */
  .extern LATCSET          /* 0xBF860238 */
  .extern LATCINV          /* 0xBF86023C */
  .extern ODCC             /* 0xBF860240 */
  .extern ODCCCLR          /* 0xBF860244 */
  .extern ODCCSET          /* 0xBF860248 */
  .extern ODCCINV          /* 0xBF86024C */
  .extern CNPUC            /* 0xBF860250 */
  .extern CNPUCCLR         /* 0xBF860254 */
  .extern CNPUCSET         /* 0xBF860258 */
  .extern CNPUCINV         /* 0xBF86025C */
  .extern CNPDC            /* 0xBF860260 */
  .extern CNPDCCLR         /* 0xBF860264 */
  .extern CNPDCSET         /* 0xBF860268 */
  .extern CNPDCINV         /* 0xBF86026C */
  .extern CNCONC           /* 0xBF860270 */
  .extern CNCONCCLR        /* 0xBF860274 */
  .extern CNCONCSET        /* 0xBF860278 */
  .extern CNCONCINV        /* 0xBF86027C */
  .extern CNENC            /* 0xBF860280 */
  .extern CNENCCLR         /* 0xBF860284 */
  .extern CNENCSET         /* 0xBF860288 */
  .extern CNENCINV         /* 0xBF86028C */
  .extern CNSTATC          /* 0xBF860290 */
  .extern CNSTATCCLR       /* 0xBF860294 */
  .extern CNSTATCSET       /* 0xBF860298 */
  .extern CNSTATCINV       /* 0xBF86029C */
  .extern CNNEC            /* 0xBF8602A0 */
  .extern CNNECCLR         /* 0xBF8602A4 */
  .extern CNNECSET         /* 0xBF8602A8 */
  .extern CNNECINV         /* 0xBF8602AC */
  .extern CNFC             /* 0xBF8602B0 */
  .extern CNFCCLR          /* 0xBF8602B4 */
  .extern CNFCSET          /* 0xBF8602B8 */
  .extern CNFCINV          /* 0xBF8602BC */
  .extern SRCON0C          /* 0xBF8602C0 */
  .extern SRCON0CCLR       /* 0xBF8602C4 */
  .extern SRCON0CSET       /* 0xBF8602C8 */
  .extern SRCON0CINV       /* 0xBF8602CC */
  .extern SRCON1C          /* 0xBF8602D0 */
  .extern SRCON1CCLR       /* 0xBF8602D4 */
  .extern SRCON1CSET       /* 0xBF8602D8 */
  .extern SRCON1CINV       /* 0xBF8602DC */
  .extern ANSELD           /* 0xBF860300 */
  .extern ANSELDCLR        /* 0xBF860304 */
  .extern ANSELDSET        /* 0xBF860308 */
  .extern ANSELDINV        /* 0xBF86030C */
  .extern TRISD            /* 0xBF860310 */
  .extern TRISDCLR         /* 0xBF860314 */
  .extern TRISDSET         /* 0xBF860318 */
  .extern TRISDINV         /* 0xBF86031C */
  .extern PORTD            /* 0xBF860320 */
  .extern PORTDCLR         /* 0xBF860324 */
  .extern PORTDSET         /* 0xBF860328 */
  .extern PORTDINV         /* 0xBF86032C */
  .extern LATD             /* 0xBF860330 */
  .extern LATDCLR          /* 0xBF860334 */
  .extern LATDSET          /* 0xBF860338 */
  .extern LATDINV          /* 0xBF86033C */
  .extern ODCD             /* 0xBF860340 */
  .extern ODCDCLR          /* 0xBF860344 */
  .extern ODCDSET          /* 0xBF860348 */
  .extern ODCDINV          /* 0xBF86034C */
  .extern CNPUD            /* 0xBF860350 */
  .extern CNPUDCLR         /* 0xBF860354 */
  .extern CNPUDSET         /* 0xBF860358 */
  .extern CNPUDINV         /* 0xBF86035C */
  .extern CNPDD            /* 0xBF860360 */
  .extern CNPDDCLR         /* 0xBF860364 */
  .extern CNPDDSET         /* 0xBF860368 */
  .extern CNPDDINV         /* 0xBF86036C */
  .extern CNCOND           /* 0xBF860370 */
  .extern CNCONDCLR        /* 0xBF860374 */
  .extern CNCONDSET        /* 0xBF860378 */
  .extern CNCONDINV        /* 0xBF86037C */
  .extern CNEND            /* 0xBF860380 */
  .extern CNENDCLR         /* 0xBF860384 */
  .extern CNENDSET         /* 0xBF860388 */
  .extern CNENDINV         /* 0xBF86038C */
  .extern CNSTATD          /* 0xBF860390 */
  .extern CNSTATDCLR       /* 0xBF860394 */
  .extern CNSTATDSET       /* 0xBF860398 */
  .extern CNSTATDINV       /* 0xBF86039C */
  .extern CNNED            /* 0xBF8603A0 */
  .extern CNNEDCLR         /* 0xBF8603A4 */
  .extern CNNEDSET         /* 0xBF8603A8 */
  .extern CNNEDINV         /* 0xBF8603AC */
  .extern CNFD             /* 0xBF8603B0 */
  .extern CNFDCLR          /* 0xBF8603B4 */
  .extern CNFDSET          /* 0xBF8603B8 */
  .extern CNFDINV          /* 0xBF8603BC */
  .extern SRCON0D          /* 0xBF8603C0 */
  .extern SRCON0DCLR       /* 0xBF8603C4 */
  .extern SRCON0DSET       /* 0xBF8603C8 */
  .extern SRCON0DINV       /* 0xBF8603CC */
  .extern SRCON1D          /* 0xBF8603D0 */
  .extern SRCON1DCLR       /* 0xBF8603D4 */
  .extern SRCON1DSET       /* 0xBF8603D8 */
  .extern SRCON1DINV       /* 0xBF8603DC */
  .extern CFD1CON          /* 0xBF880000 */
  .extern CFD1CONCLR       /* 0xBF880004 */
  .extern CFD1CONSET       /* 0xBF880008 */
  .extern CFD1CONINV       /* 0xBF88000C */
  .extern CFD1NBTCFG       /* 0xBF880010 */
  .extern CFD1NBTCFGCLR    /* 0xBF880014 */
  .extern CFD1NBTCFGSET    /* 0xBF880018 */
  .extern CFD1NBTCFGINV    /* 0xBF88001C */
  .extern CFD1DBTCFG       /* 0xBF880020 */
  .extern CFD1DBTCFGCLR    /* 0xBF880024 */
  .extern CFD1DBTCFGSET    /* 0xBF880028 */
  .extern CFD1DBTCFGINV    /* 0xBF88002C */
  .extern CFD1TDC          /* 0xBF880030 */
  .extern CFD1TDCCLR       /* 0xBF880034 */
  .extern CFD1TDCSET       /* 0xBF880038 */
  .extern CFD1TDCINV       /* 0xBF88003C */
  .extern CFD1TBC          /* 0xBF880040 */
  .extern CFD1TBCCLR       /* 0xBF880044 */
  .extern CFD1TBCSET       /* 0xBF880048 */
  .extern CFD1TBCINV       /* 0xBF88004C */
  .extern CFD1TSCON        /* 0xBF880050 */
  .extern CFD1TSCONCLR     /* 0xBF880054 */
  .extern CFD1TSCONSET     /* 0xBF880058 */
  .extern CFD1TSCONINV     /* 0xBF88005C */
  .extern CFD1VEC          /* 0xBF880060 */
  .extern CFD1VECCLR       /* 0xBF880064 */
  .extern CFD1VECSET       /* 0xBF880068 */
  .extern CFD1VECINV       /* 0xBF88006C */
  .extern CFD1INT          /* 0xBF880070 */
  .extern CFD1INTCLR       /* 0xBF880074 */
  .extern CFD1INTSET       /* 0xBF880078 */
  .extern CFD1INTINV       /* 0xBF88007C */
  .extern CFD1RXIF         /* 0xBF880080 */
  .extern CFD1RXIFCLR      /* 0xBF880084 */
  .extern CFD1RXIFSET      /* 0xBF880088 */
  .extern CFD1RXIFINV      /* 0xBF88008C */
  .extern CFD1TXIF         /* 0xBF880090 */
  .extern CFD1TXIFCLR      /* 0xBF880094 */
  .extern CFD1TXIFSET      /* 0xBF880098 */
  .extern CFD1TXIFINV      /* 0xBF88009C */
  .extern CFD1RXOVIF       /* 0xBF8800A0 */
  .extern CFD1RXOVIFCLR    /* 0xBF8800A4 */
  .extern CFD1RXOVIFSET    /* 0xBF8800A8 */
  .extern CFD1RXOVIFINV    /* 0xBF8800AC */
  .extern CFD1TXATIF       /* 0xBF8800B0 */
  .extern CFD1TXATIFCLR    /* 0xBF8800B4 */
  .extern CFD1TXATIFSET    /* 0xBF8800B8 */
  .extern CFD1TXATIFINV    /* 0xBF8800BC */
  .extern CFD1TXREQ        /* 0xBF8800C0 */
  .extern CFD1TXREQCLR     /* 0xBF8800C4 */
  .extern CFD1TXREQSET     /* 0xBF8800C8 */
  .extern CFD1TXREQINV     /* 0xBF8800CC */
  .extern CFD1TREC         /* 0xBF8800D0 */
  .extern CFD1TRECCLR      /* 0xBF8800D4 */
  .extern CFD1TRECSET      /* 0xBF8800D8 */
  .extern CFD1TRECINV      /* 0xBF8800DC */
  .extern CFD1BDIAG0       /* 0xBF8800E0 */
  .extern CFD1BDIAG0CLR    /* 0xBF8800E4 */
  .extern CFD1BDIAG0SET    /* 0xBF8800E8 */
  .extern CFD1BDIAG0INV    /* 0xBF8800EC */
  .extern CFD1BDIAG1       /* 0xBF8800F0 */
  .extern CFD1BDIAG1CLR    /* 0xBF8800F4 */
  .extern CFD1BDIAG1SET    /* 0xBF8800F8 */
  .extern CFD1BDIAG1INV    /* 0xBF8800FC */
  .extern CFD1TEFCON       /* 0xBF880100 */
  .extern CFD1TEFCONCLR    /* 0xBF880104 */
  .extern CFD1TEFCONSET    /* 0xBF880108 */
  .extern CFD1TEFCONINV    /* 0xBF88010C */
  .extern CFD1TEFSTA       /* 0xBF880110 */
  .extern CFD1TEFSTACLR    /* 0xBF880114 */
  .extern CFD1TEFSTASET    /* 0xBF880118 */
  .extern CFD1TEFSTAINV    /* 0xBF88011C */
  .extern CFD1TEFUA        /* 0xBF880120 */
  .extern CFD1TEFUACLR     /* 0xBF880124 */
  .extern CFD1TEFUASET     /* 0xBF880128 */
  .extern CFD1TEFUAINV     /* 0xBF88012C */
  .extern CFD1FIFOBA       /* 0xBF880130 */
  .extern CFD1FIFOBACLR    /* 0xBF880134 */
  .extern CFD1FIFOBASET    /* 0xBF880138 */
  .extern CFD1FIFOBAINV    /* 0xBF88013C */
  .extern CFD1TXQCON       /* 0xBF880140 */
  .extern CFD1TXQCONCLR    /* 0xBF880144 */
  .extern CFD1TXQCONSET    /* 0xBF880148 */
  .extern CFD1TXQCONINV    /* 0xBF88014C */
  .extern CFD1TXQSTA       /* 0xBF880150 */
  .extern CFD1TXQSTACLR    /* 0xBF880154 */
  .extern CFD1TXQSTASET    /* 0xBF880158 */
  .extern CFD1TXQSTAINV    /* 0xBF88015C */
  .extern CFD1TXQUA        /* 0xBF880160 */
  .extern CFD1TXQUACLR     /* 0xBF880164 */
  .extern CFD1TXQUASET     /* 0xBF880168 */
  .extern CFD1TXQUAINV     /* 0xBF88016C */
  .extern CFD1FIFOCON1     /* 0xBF880170 */
  .extern CFD1FIFOCON1CLR  /* 0xBF880174 */
  .extern CFD1FIFOCON1SET  /* 0xBF880178 */
  .extern CFD1FIFOCON1INV  /* 0xBF88017C */
  .extern CFD1FIFOSTA1     /* 0xBF880180 */
  .extern CFD1FIFOSTA1CLR  /* 0xBF880184 */
  .extern CFD1FIFOSTA1SET  /* 0xBF880188 */
  .extern CFD1FIFOSTA1INV  /* 0xBF88018C */
  .extern CFD1FIFOUA1      /* 0xBF880190 */
  .extern CFD1FIFOUA1CLR   /* 0xBF880194 */
  .extern CFD1FIFOUA1SET   /* 0xBF880198 */
  .extern CFD1FIFOUA1INV   /* 0xBF88019C */
  .extern CFD1FIFOCON2     /* 0xBF8801A0 */
  .extern CFD1FIFOCON2CLR  /* 0xBF8801A4 */
  .extern CFD1FIFOCON2SET  /* 0xBF8801A8 */
  .extern CFD1FIFOCON2INV  /* 0xBF8801AC */
  .extern CFD1FIFOSTA2     /* 0xBF8801B0 */
  .extern CFD1FIFOSTA2CLR  /* 0xBF8801B4 */
  .extern CFD1FIFOSTA2SET  /* 0xBF8801B8 */
  .extern CFD1FIFOSTA2INV  /* 0xBF8801BC */
  .extern CFD1FIFOUA2      /* 0xBF8801C0 */
  .extern CFD1FIFOUA2CLR   /* 0xBF8801C4 */
  .extern CFD1FIFOUA2SET   /* 0xBF8801C8 */
  .extern CFD1FIFOUA2INV   /* 0xBF8801CC */
  .extern CFD1FIFOCON3     /* 0xBF8801D0 */
  .extern CFD1FIFOCON3CLR  /* 0xBF8801D4 */
  .extern CFD1FIFOCON3SET  /* 0xBF8801D8 */
  .extern CFD1FIFOCON3INV  /* 0xBF8801DC */
  .extern CFD1FIFOSTA3     /* 0xBF8801E0 */
  .extern CFD1FIFOSTA3CLR  /* 0xBF8801E4 */
  .extern CFD1FIFOSTA3SET  /* 0xBF8801E8 */
  .extern CFD1FIFOSTA3INV  /* 0xBF8801EC */
  .extern CFD1FIFOUA3      /* 0xBF8801F0 */
  .extern CFD1FIFOUA3CLR   /* 0xBF8801F4 */
  .extern CFD1FIFOUA3SET   /* 0xBF8801F8 */
  .extern CFD1FIFOUA3INV   /* 0xBF8801FC */
  .extern CFD1FIFOCON4     /* 0xBF880200 */
  .extern CFD1FIFOCON4CLR  /* 0xBF880204 */
  .extern CFD1FIFOCON4SET  /* 0xBF880208 */
  .extern CFD1FIFOCON4INV  /* 0xBF88020C */
  .extern CFD1FIFOSTA4     /* 0xBF880210 */
  .extern CFD1FIFOSTA4CLR  /* 0xBF880214 */
  .extern CFD1FIFOSTA4SET  /* 0xBF880218 */
  .extern CFD1FIFOSTA4INV  /* 0xBF88021C */
  .extern CFD1FIFOUA4      /* 0xBF880220 */
  .extern CFD1FIFOUA4CLR   /* 0xBF880224 */
  .extern CFD1FIFOUA4SET   /* 0xBF880228 */
  .extern CFD1FIFOUA4INV   /* 0xBF88022C */
  .extern CFD1FIFOCON5     /* 0xBF880230 */
  .extern CFD1FIFOCON5CLR  /* 0xBF880234 */
  .extern CFD1FIFOCON5SET  /* 0xBF880238 */
  .extern CFD1FIFOCON5INV  /* 0xBF88023C */
  .extern CFD1FIFOSTA5     /* 0xBF880240 */
  .extern CFD1FIFOSTA5CLR  /* 0xBF880244 */
  .extern CFD1FIFOSTA5SET  /* 0xBF880248 */
  .extern CFD1FIFOSTA5INV  /* 0xBF88024C */
  .extern CFD1FIFOUA5      /* 0xBF880250 */
  .extern CFD1FIFOUA5CLR   /* 0xBF880254 */
  .extern CFD1FIFOUA5SET   /* 0xBF880258 */
  .extern CFD1FIFOUA5INV   /* 0xBF88025C */
  .extern CFD1FIFOCON6     /* 0xBF880260 */
  .extern CFD1FIFOCON6CLR  /* 0xBF880264 */
  .extern CFD1FIFOCON6SET  /* 0xBF880268 */
  .extern CFD1FIFOCON6INV  /* 0xBF88026C */
  .extern CFD1FIFOSTA6     /* 0xBF880270 */
  .extern CFD1FIFOSTA6CLR  /* 0xBF880274 */
  .extern CFD1FIFOSTA6SET  /* 0xBF880278 */
  .extern CFD1FIFOSTA6INV  /* 0xBF88027C */
  .extern CFD1FIFOUA6      /* 0xBF880280 */
  .extern CFD1FIFOUA6CLR   /* 0xBF880284 */
  .extern CFD1FIFOUA6SET   /* 0xBF880288 */
  .extern CFD1FIFOUA6INV   /* 0xBF88028C */
  .extern CFD1FIFOCON7     /* 0xBF880290 */
  .extern CFD1FIFOCON7CLR  /* 0xBF880294 */
  .extern CFD1FIFOCON7SET  /* 0xBF880298 */
  .extern CFD1FIFOCON7INV  /* 0xBF88029C */
  .extern CFD1FIFOSTA7     /* 0xBF8802A0 */
  .extern CFD1FIFOSTA7CLR  /* 0xBF8802A4 */
  .extern CFD1FIFOSTA7SET  /* 0xBF8802A8 */
  .extern CFD1FIFOSTA7INV  /* 0xBF8802AC */
  .extern CFD1FIFOUA7      /* 0xBF8802B0 */
  .extern CFD1FIFOUA7CLR   /* 0xBF8802B4 */
  .extern CFD1FIFOUA7SET   /* 0xBF8802B8 */
  .extern CFD1FIFOUA7INV   /* 0xBF8802BC */
  .extern CFD1FIFOCON8     /* 0xBF8802C0 */
  .extern CFD1FIFOCON8CLR  /* 0xBF8802C4 */
  .extern CFD1FIFOCON8SET  /* 0xBF8802C8 */
  .extern CFD1FIFOCON8INV  /* 0xBF8802CC */
  .extern CFD1FIFOSTA8     /* 0xBF8802D0 */
  .extern CFD1FIFOSTA8CLR  /* 0xBF8802D4 */
  .extern CFD1FIFOSTA8SET  /* 0xBF8802D8 */
  .extern CFD1FIFOSTA8INV  /* 0xBF8802DC */
  .extern CFD1FIFOUA8      /* 0xBF8802E0 */
  .extern CFD1FIFOUA8CLR   /* 0xBF8802E4 */
  .extern CFD1FIFOUA8SET   /* 0xBF8802E8 */
  .extern CFD1FIFOUA8INV   /* 0xBF8802EC */
  .extern CFD1FIFOCON9     /* 0xBF8802F0 */
  .extern CFD1FIFOCON9CLR  /* 0xBF8802F4 */
  .extern CFD1FIFOCON9SET  /* 0xBF8802F8 */
  .extern CFD1FIFOCON9INV  /* 0xBF8802FC */
  .extern CFD1FIFOSTA9     /* 0xBF880300 */
  .extern CFD1FIFOSTA9CLR  /* 0xBF880304 */
  .extern CFD1FIFOSTA9SET  /* 0xBF880308 */
  .extern CFD1FIFOSTA9INV  /* 0xBF88030C */
  .extern CFD1FIFOUA9      /* 0xBF880310 */
  .extern CFD1FIFOUA9CLR   /* 0xBF880314 */
  .extern CFD1FIFOUA9SET   /* 0xBF880318 */
  .extern CFD1FIFOUA9INV   /* 0xBF88031C */
  .extern CFD1FIFOCON10    /* 0xBF880320 */
  .extern CFD1FIFOCON10CLR /* 0xBF880324 */
  .extern CFD1FIFOCON10SET /* 0xBF880328 */
  .extern CFD1FIFOCON10INV /* 0xBF88032C */
  .extern CFD1FIFOSTA10    /* 0xBF880330 */
  .extern CFD1FIFOSTA10CLR /* 0xBF880334 */
  .extern CFD1FIFOSTA10SET /* 0xBF880338 */
  .extern CFD1FIFOSTA10INV /* 0xBF88033C */
  .extern CFD1FIFOUA10     /* 0xBF880340 */
  .extern CFD1FIFOUA10CLR  /* 0xBF880344 */
  .extern CFD1FIFOUA10SET  /* 0xBF880348 */
  .extern CFD1FIFOUA10INV  /* 0xBF88034C */
  .extern CFD1FIFOCON11    /* 0xBF880350 */
  .extern CFD1FIFOCON11CLR /* 0xBF880354 */
  .extern CFD1FIFOCON11SET /* 0xBF880358 */
  .extern CFD1FIFOCON11INV /* 0xBF88035C */
  .extern CFD1FIFOSTA11    /* 0xBF880360 */
  .extern CFD1FIFOSTA11CLR /* 0xBF880364 */
