Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
#define _PMD4_T9MD_POSITION                      0x00000008
#define _PMD4_T9MD_MASK                          0x00000100
#define _PMD4_T9MD_LENGTH                        0x00000001

#define _PMD4_PWM1MD_POSITION                    0x00000010
#define _PMD4_PWM1MD_MASK                        0x00010000
#define _PMD4_PWM1MD_LENGTH                      0x00000001

#define _PMD4_PWM2MD_POSITION                    0x00000011
#define _PMD4_PWM2MD_MASK                        0x00020000
#define _PMD4_PWM2MD_LENGTH                      0x00000001

#define _PMD4_PWM3MD_POSITION                    0x00000012
#define _PMD4_PWM3MD_MASK                        0x00040000
#define _PMD4_PWM3MD_LENGTH                      0x00000001

#define _PMD4_PWM4MD_POSITION                    0x00000013
#define _PMD4_PWM4MD_MASK                        0x00080000
#define _PMD4_PWM4MD_LENGTH                      0x00000001

#define _PMD4_PWM5MD_POSITION                    0x00000014
#define _PMD4_PWM5MD_MASK                        0x00100000
#define _PMD4_PWM5MD_LENGTH                      0x00000001

#define _PMD4_PWM6MD_POSITION                    0x00000015
#define _PMD4_PWM6MD_MASK                        0x00200000
#define _PMD4_PWM6MD_LENGTH                      0x00000001

#define _PMD4_PWM7MD_POSITION                    0x00000016
#define _PMD4_PWM7MD_MASK                        0x00400000
#define _PMD4_PWM7MD_LENGTH                      0x00000001

#define _PMD4_PWM8MD_POSITION                    0x00000017
#define _PMD4_PWM8MD_MASK                        0x00800000
#define _PMD4_PWM8MD_LENGTH                      0x00000001

#define _PMD4_PWM9MD_POSITION                    0x00000018
#define _PMD4_PWM9MD_MASK                        0x01000000
#define _PMD4_PWM9MD_LENGTH                      0x00000001

#define _PMD4_PWM10MD_POSITION                   0x00000019
#define _PMD4_PWM10MD_MASK                       0x02000000
#define _PMD4_PWM10MD_LENGTH                     0x00000001

#define _PMD4_PWM11MD_POSITION                   0x0000001A
#define _PMD4_PWM11MD_MASK                       0x04000000
#define _PMD4_PWM11MD_LENGTH                     0x00000001

#define _PMD4_PWM12MD_POSITION                   0x0000001B
#define _PMD4_PWM12MD_MASK                       0x08000000
#define _PMD4_PWM12MD_LENGTH                     0x00000001

#define _PMD5_U1MD_POSITION                      0x00000000
#define _PMD5_U1MD_MASK                          0x00000001
#define _PMD5_U1MD_LENGTH                        0x00000001

#define _PMD5_U2MD_POSITION                      0x00000001
#define _PMD5_U2MD_MASK                          0x00000002
#define _PMD5_U2MD_LENGTH                        0x00000001

#define _PMD5_U3MD_POSITION                      0x00000002
#define _PMD5_U3MD_MASK                          0x00000004
#define _PMD5_U3MD_LENGTH                        0x00000001

#define _PMD5_U4MD_POSITION                      0x00000003
#define _PMD5_U4MD_MASK                          0x00000008
#define _PMD5_U4MD_LENGTH                        0x00000001

#define _PMD5_U5MD_POSITION                      0x00000004
#define _PMD5_U5MD_MASK                          0x00000010
#define _PMD5_U5MD_LENGTH                        0x00000001

#define _PMD5_U6MD_POSITION                      0x00000005
#define _PMD5_U6MD_MASK                          0x00000020
#define _PMD5_U6MD_LENGTH                        0x00000001

#define _PMD5_SPI1MD_POSITION                    0x00000008
#define _PMD5_SPI1MD_MASK                        0x00000100
#define _PMD5_SPI1MD_LENGTH                      0x00000001

#define _PMD5_SPI2MD_POSITION                    0x00000009
#define _PMD5_SPI2MD_MASK                        0x00000200
#define _PMD5_SPI2MD_LENGTH                      0x00000001

#define _PMD5_SPI3MD_POSITION                    0x0000000A
#define _PMD5_SPI3MD_MASK                        0x00000400
#define _PMD5_SPI3MD_LENGTH                      0x00000001

#define _PMD5_SPI4MD_POSITION                    0x0000000B
#define _PMD5_SPI4MD_MASK                        0x00000800
#define _PMD5_SPI4MD_LENGTH                      0x00000001

#define _PMD5_SPI5MD_POSITION                    0x0000000C
#define _PMD5_SPI5MD_MASK                        0x00001000
#define _PMD5_SPI5MD_LENGTH                      0x00000001

#define _PMD5_SPI6MD_POSITION                    0x0000000D
#define _PMD5_SPI6MD_MASK                        0x00002000
#define _PMD5_SPI6MD_LENGTH                      0x00000001

#define _PMD5_I2C1MD_POSITION                    0x00000010
#define _PMD5_I2C1MD_MASK                        0x00010000
#define _PMD5_I2C1MD_LENGTH                      0x00000001

#define _PMD5_I2C2MD_POSITION                    0x00000011
#define _PMD5_I2C2MD_MASK                        0x00020000
#define _PMD5_I2C2MD_LENGTH                      0x00000001

#define _PMD5_I2C3MD_POSITION                    0x00000012
#define _PMD5_I2C3MD_MASK                        0x00040000
#define _PMD5_I2C3MD_LENGTH                      0x00000001

#define _PMD5_I2C4MD_POSITION                    0x00000013
#define _PMD5_I2C4MD_MASK                        0x00080000
#define _PMD5_I2C4MD_LENGTH                      0x00000001

#define _PMD5_USB1MD_POSITION                    0x00000018
#define _PMD5_USB1MD_MASK                        0x01000000
#define _PMD5_USB1MD_LENGTH                      0x00000001

#define _PMD5_USB2MD_POSITION                    0x00000019
#define _PMD5_USB2MD_MASK                        0x02000000
#define _PMD5_USB2MD_LENGTH                      0x00000001

#define _PMD5_CAN1MD_POSITION                    0x0000001C
#define _PMD5_CAN1MD_MASK                        0x10000000
#define _PMD5_CAN1MD_LENGTH                      0x00000001

#define _PMD5_CAN2MD_POSITION                    0x0000001D
#define _PMD5_CAN2MD_MASK                        0x20000000
#define _PMD5_CAN2MD_LENGTH                      0x00000001

#define _PMD5_CAN3MD_POSITION                    0x0000001E
#define _PMD5_CAN3MD_MASK                        0x40000000
#define _PMD5_CAN3MD_LENGTH                      0x00000001

#define _PMD5_CAN4MD_POSITION                    0x0000001F
#define _PMD5_CAN4MD_MASK                        0x80000000
#define _PMD5_CAN4MD_LENGTH                      0x00000001

#define _PMD6_REFO1MD_POSITION                   0x00000008
#define _PMD6_REFO1MD_MASK                       0x00000100
#define _PMD6_REFO1MD_LENGTH                     0x00000001

#define _PMD6_REFO2MD_POSITION                   0x00000009
#define _PMD6_REFO2MD_MASK                       0x00000200
#define _PMD6_REFO2MD_LENGTH                     0x00000001

