Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
#define _IPC61_PCACHEIS_POSITION                 0x00000018
#define _IPC61_PCACHEIS_MASK                     0x03000000
#define _IPC61_PCACHEIS_LENGTH                   0x00000002

#define _IPC61_PCACHEIP_POSITION                 0x0000001A
#define _IPC61_PCACHEIP_MASK                     0x1C000000
#define _IPC61_PCACHEIP_LENGTH                   0x00000003

#define _IPC61_w_POSITION                        0x00000000
#define _IPC61_w_MASK                            0xFFFFFFFF
#define _IPC61_w_LENGTH                          0x00000020

#define _IPC62_CLC1IS_POSITION                   0x00000008
#define _IPC62_CLC1IS_MASK                       0x00000300
#define _IPC62_CLC1IS_LENGTH                     0x00000002

#define _IPC62_CLC1IP_POSITION                   0x0000000A
#define _IPC62_CLC1IP_MASK                       0x00001C00
#define _IPC62_CLC1IP_LENGTH                     0x00000003

#define _IPC62_CLC2IS_POSITION                   0x00000010
#define _IPC62_CLC2IS_MASK                       0x00030000
#define _IPC62_CLC2IS_LENGTH                     0x00000002

#define _IPC62_CLC2IP_POSITION                   0x00000012
#define _IPC62_CLC2IP_MASK                       0x001C0000
#define _IPC62_CLC2IP_LENGTH                     0x00000003

#define _IPC62_CLC3IS_POSITION                   0x00000018
#define _IPC62_CLC3IS_MASK                       0x03000000
#define _IPC62_CLC3IS_LENGTH                     0x00000002

#define _IPC62_CLC3IP_POSITION                   0x0000001A
#define _IPC62_CLC3IP_MASK                       0x1C000000
#define _IPC62_CLC3IP_LENGTH                     0x00000003

#define _IPC62_w_POSITION                        0x00000000
#define _IPC62_w_MASK                            0xFFFFFFFF
#define _IPC62_w_LENGTH                          0x00000020

#define _IPC63_CLC4IS_POSITION                   0x00000000
#define _IPC63_CLC4IS_MASK                       0x00000003
#define _IPC63_CLC4IS_LENGTH                     0x00000002

#define _IPC63_CLC4IP_POSITION                   0x00000002
#define _IPC63_CLC4IP_MASK                       0x0000001C
#define _IPC63_CLC4IP_LENGTH                     0x00000003

#define _IPC63_CPCIS_POSITION                    0x00000010
#define _IPC63_CPCIS_MASK                        0x00030000
#define _IPC63_CPCIS_LENGTH                      0x00000002

#define _IPC63_CPCIP_POSITION                    0x00000012
#define _IPC63_CPCIP_MASK                        0x001C0000
#define _IPC63_CPCIP_LENGTH                      0x00000003

#define _IPC63_CFDCIS_POSITION                   0x00000018
#define _IPC63_CFDCIS_MASK                       0x03000000
#define _IPC63_CFDCIS_LENGTH                     0x00000002

#define _IPC63_CFDCIP_POSITION                   0x0000001A
#define _IPC63_CFDCIP_MASK                       0x1C000000
#define _IPC63_CFDCIP_LENGTH                     0x00000003

#define _IPC63_w_POSITION                        0x00000000
#define _IPC63_w_MASK                            0xFFFFFFFF
#define _IPC63_w_LENGTH                          0x00000020

#define _OFF000_VOFF_POSITION                    0x00000001
#define _OFF000_VOFF_MASK                        0x0003FFFE
#define _OFF000_VOFF_LENGTH                      0x00000011

#define _OFF001_VOFF_POSITION                    0x00000001
#define _OFF001_VOFF_MASK                        0x0003FFFE
#define _OFF001_VOFF_LENGTH                      0x00000011

#define _OFF002_VOFF_POSITION                    0x00000001
#define _OFF002_VOFF_MASK                        0x0003FFFE
#define _OFF002_VOFF_LENGTH                      0x00000011

#define _OFF003_VOFF_POSITION                    0x00000001
#define _OFF003_VOFF_MASK                        0x0003FFFE
#define _OFF003_VOFF_LENGTH                      0x00000011

#define _OFF004_VOFF_POSITION                    0x00000001
#define _OFF004_VOFF_MASK                        0x0003FFFE
#define _OFF004_VOFF_LENGTH                      0x00000011

#define _OFF005_VOFF_POSITION                    0x00000001
#define _OFF005_VOFF_MASK                        0x0003FFFE
#define _OFF005_VOFF_LENGTH                      0x00000011

#define _OFF006_VOFF_POSITION                    0x00000001
#define _OFF006_VOFF_MASK                        0x0003FFFE
#define _OFF006_VOFF_LENGTH                      0x00000011

#define _OFF007_VOFF_POSITION                    0x00000001
#define _OFF007_VOFF_MASK                        0x0003FFFE
#define _OFF007_VOFF_LENGTH                      0x00000011

#define _OFF008_VOFF_POSITION                    0x00000001
#define _OFF008_VOFF_MASK                        0x0003FFFE
#define _OFF008_VOFF_LENGTH                      0x00000011

#define _OFF009_VOFF_POSITION                    0x00000001
#define _OFF009_VOFF_MASK                        0x0003FFFE
#define _OFF009_VOFF_LENGTH                      0x00000011

#define _OFF010_VOFF_POSITION                    0x00000001
#define _OFF010_VOFF_MASK                        0x0003FFFE
#define _OFF010_VOFF_LENGTH                      0x00000011

#define _OFF011_VOFF_POSITION                    0x00000001
#define _OFF011_VOFF_MASK                        0x0003FFFE
#define _OFF011_VOFF_LENGTH                      0x00000011

#define _OFF012_VOFF_POSITION                    0x00000001
#define _OFF012_VOFF_MASK                        0x0003FFFE
#define _OFF012_VOFF_LENGTH                      0x00000011

#define _OFF013_VOFF_POSITION                    0x00000001
#define _OFF013_VOFF_MASK                        0x0003FFFE
#define _OFF013_VOFF_LENGTH                      0x00000011

#define _OFF014_VOFF_POSITION                    0x00000001
#define _OFF014_VOFF_MASK                        0x0003FFFE
#define _OFF014_VOFF_LENGTH                      0x00000011

#define _OFF015_VOFF_POSITION                    0x00000001
#define _OFF015_VOFF_MASK                        0x0003FFFE
#define _OFF015_VOFF_LENGTH                      0x00000011

#define _OFF016_VOFF_POSITION                    0x00000001
#define _OFF016_VOFF_MASK                        0x0003FFFE
#define _OFF016_VOFF_LENGTH                      0x00000011

#define _OFF017_VOFF_POSITION                    0x00000001
#define _OFF017_VOFF_MASK                        0x0003FFFE
#define _OFF017_VOFF_LENGTH                      0x00000011

#define _OFF018_VOFF_POSITION                    0x00000001
#define _OFF018_VOFF_MASK                        0x0003FFFE
#define _OFF018_VOFF_LENGTH                      0x00000011

#define _OFF019_VOFF_POSITION                    0x00000001
#define _OFF019_VOFF_MASK                        0x0003FFFE
#define _OFF019_VOFF_LENGTH                      0x00000011

#define _OFF020_VOFF_POSITION                    0x00000001
#define _OFF020_VOFF_MASK                        0x0003FFFE
#define _OFF020_VOFF_LENGTH                      0x00000011

#define _OFF021_VOFF_POSITION                    0x00000001
#define _OFF021_VOFF_MASK                        0x0003FFFE
#define _OFF021_VOFF_LENGTH                      0x00000011

