Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
#define _OFF106_VOFF_POSITION                    0x00000001
#define _OFF106_VOFF_MASK                        0x0003FFFE
#define _OFF106_VOFF_LENGTH                      0x00000011

#define _OFF107_VOFF_POSITION                    0x00000001
#define _OFF107_VOFF_MASK                        0x0003FFFE
#define _OFF107_VOFF_LENGTH                      0x00000011

#define _OFF108_VOFF_POSITION                    0x00000001
#define _OFF108_VOFF_MASK                        0x0003FFFE
#define _OFF108_VOFF_LENGTH                      0x00000011

#define _OFF109_VOFF_POSITION                    0x00000001
#define _OFF109_VOFF_MASK                        0x0003FFFE
#define _OFF109_VOFF_LENGTH                      0x00000011

#define _OFF110_VOFF_POSITION                    0x00000001
#define _OFF110_VOFF_MASK                        0x0003FFFE
#define _OFF110_VOFF_LENGTH                      0x00000011

#define _OFF111_VOFF_POSITION                    0x00000001
#define _OFF111_VOFF_MASK                        0x0003FFFE
#define _OFF111_VOFF_LENGTH                      0x00000011

#define _OFF112_VOFF_POSITION                    0x00000001
#define _OFF112_VOFF_MASK                        0x0003FFFE
#define _OFF112_VOFF_LENGTH                      0x00000011

#define _OFF113_VOFF_POSITION                    0x00000001
#define _OFF113_VOFF_MASK                        0x0003FFFE
#define _OFF113_VOFF_LENGTH                      0x00000011

#define _OFF114_VOFF_POSITION                    0x00000001
#define _OFF114_VOFF_MASK                        0x0003FFFE
#define _OFF114_VOFF_LENGTH                      0x00000011

#define _OFF115_VOFF_POSITION                    0x00000001
#define _OFF115_VOFF_MASK                        0x0003FFFE
#define _OFF115_VOFF_LENGTH                      0x00000011

#define _OFF116_VOFF_POSITION                    0x00000001
#define _OFF116_VOFF_MASK                        0x0003FFFE
#define _OFF116_VOFF_LENGTH                      0x00000011

#define _OFF117_VOFF_POSITION                    0x00000001
#define _OFF117_VOFF_MASK                        0x0003FFFE
#define _OFF117_VOFF_LENGTH                      0x00000011

#define _OFF118_VOFF_POSITION                    0x00000001
#define _OFF118_VOFF_MASK                        0x0003FFFE
#define _OFF118_VOFF_LENGTH                      0x00000011

#define _OFF119_VOFF_POSITION                    0x00000001
#define _OFF119_VOFF_MASK                        0x0003FFFE
#define _OFF119_VOFF_LENGTH                      0x00000011

#define _OFF120_VOFF_POSITION                    0x00000001
#define _OFF120_VOFF_MASK                        0x0003FFFE
#define _OFF120_VOFF_LENGTH                      0x00000011

#define _OFF121_VOFF_POSITION                    0x00000001
#define _OFF121_VOFF_MASK                        0x0003FFFE
#define _OFF121_VOFF_LENGTH                      0x00000011

#define _OFF122_VOFF_POSITION                    0x00000001
#define _OFF122_VOFF_MASK                        0x0003FFFE
#define _OFF122_VOFF_LENGTH                      0x00000011

#define _OFF123_VOFF_POSITION                    0x00000001
#define _OFF123_VOFF_MASK                        0x0003FFFE
#define _OFF123_VOFF_LENGTH                      0x00000011

#define _OFF124_VOFF_POSITION                    0x00000001
#define _OFF124_VOFF_MASK                        0x0003FFFE
#define _OFF124_VOFF_LENGTH                      0x00000011

#define _OFF125_VOFF_POSITION                    0x00000001
#define _OFF125_VOFF_MASK                        0x0003FFFE
#define _OFF125_VOFF_LENGTH                      0x00000011

#define _OFF130_VOFF_POSITION                    0x00000001
#define _OFF130_VOFF_MASK                        0x0003FFFE
#define _OFF130_VOFF_LENGTH                      0x00000011

#define _OFF131_VOFF_POSITION                    0x00000001
#define _OFF131_VOFF_MASK                        0x0003FFFE
#define _OFF131_VOFF_LENGTH                      0x00000011

#define _OFF132_VOFF_POSITION                    0x00000001
#define _OFF132_VOFF_MASK                        0x0003FFFE
#define _OFF132_VOFF_LENGTH                      0x00000011

#define _OFF133_VOFF_POSITION                    0x00000001
#define _OFF133_VOFF_MASK                        0x0003FFFE
#define _OFF133_VOFF_LENGTH                      0x00000011

#define _OFF146_VOFF_POSITION                    0x00000001
#define _OFF146_VOFF_MASK                        0x0003FFFE
#define _OFF146_VOFF_LENGTH                      0x00000011

#define _OFF147_VOFF_POSITION                    0x00000001
#define _OFF147_VOFF_MASK                        0x0003FFFE
#define _OFF147_VOFF_LENGTH                      0x00000011

#define _OFF152_VOFF_POSITION                    0x00000001
#define _OFF152_VOFF_MASK                        0x0003FFFE
#define _OFF152_VOFF_LENGTH                      0x00000011

#define _OFF153_VOFF_POSITION                    0x00000001
#define _OFF153_VOFF_MASK                        0x0003FFFE
#define _OFF153_VOFF_LENGTH                      0x00000011

#define _OFF154_VOFF_POSITION                    0x00000001
#define _OFF154_VOFF_MASK                        0x0003FFFE
#define _OFF154_VOFF_LENGTH                      0x00000011

#define _OFF155_VOFF_POSITION                    0x00000001
#define _OFF155_VOFF_MASK                        0x0003FFFE
#define _OFF155_VOFF_LENGTH                      0x00000011

#define _OFF156_VOFF_POSITION                    0x00000001
#define _OFF156_VOFF_MASK                        0x0003FFFE
#define _OFF156_VOFF_LENGTH                      0x00000011

#define _OFF157_VOFF_POSITION                    0x00000001
#define _OFF157_VOFF_MASK                        0x0003FFFE
#define _OFF157_VOFF_LENGTH                      0x00000011

#define _OFF158_VOFF_POSITION                    0x00000001
#define _OFF158_VOFF_MASK                        0x0003FFFE
#define _OFF158_VOFF_LENGTH                      0x00000011

#define _OFF159_VOFF_POSITION                    0x00000001
#define _OFF159_VOFF_MASK                        0x0003FFFE
#define _OFF159_VOFF_LENGTH                      0x00000011

#define _OFF160_VOFF_POSITION                    0x00000001
#define _OFF160_VOFF_MASK                        0x0003FFFE
#define _OFF160_VOFF_LENGTH                      0x00000011

#define _OFF161_VOFF_POSITION                    0x00000001
#define _OFF161_VOFF_MASK                        0x0003FFFE
#define _OFF161_VOFF_LENGTH                      0x00000011

