Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.6.125/include/proc/p32mk0256mcj048.h
#define _QEI1STAT_IDXIRQ_POSITION                0x00000001
#define _QEI1STAT_IDXIRQ_MASK                    0x00000002
#define _QEI1STAT_IDXIRQ_LENGTH                  0x00000001

#define _QEI1STAT_HOMIEN_POSITION                0x00000002
#define _QEI1STAT_HOMIEN_MASK                    0x00000004
#define _QEI1STAT_HOMIEN_LENGTH                  0x00000001

#define _QEI1STAT_HOMIRQ_POSITION                0x00000003
#define _QEI1STAT_HOMIRQ_MASK                    0x00000008
#define _QEI1STAT_HOMIRQ_LENGTH                  0x00000001

#define _QEI1STAT_VELOVIEN_POSITION              0x00000004
#define _QEI1STAT_VELOVIEN_MASK                  0x00000010
#define _QEI1STAT_VELOVIEN_LENGTH                0x00000001

#define _QEI1STAT_VELOVIRQ_POSITION              0x00000005
#define _QEI1STAT_VELOVIRQ_MASK                  0x00000020
#define _QEI1STAT_VELOVIRQ_LENGTH                0x00000001

#define _QEI1STAT_PCIIEN_POSITION                0x00000006
#define _QEI1STAT_PCIIEN_MASK                    0x00000040
#define _QEI1STAT_PCIIEN_LENGTH                  0x00000001

#define _QEI1STAT_PCIIRQ_POSITION                0x00000007
#define _QEI1STAT_PCIIRQ_MASK                    0x00000080
#define _QEI1STAT_PCIIRQ_LENGTH                  0x00000001

#define _QEI1STAT_POSOVIEN_POSITION              0x00000008
#define _QEI1STAT_POSOVIEN_MASK                  0x00000100
#define _QEI1STAT_POSOVIEN_LENGTH                0x00000001

#define _QEI1STAT_POSOVIRQ_POSITION              0x00000009
#define _QEI1STAT_POSOVIRQ_MASK                  0x00000200
#define _QEI1STAT_POSOVIRQ_LENGTH                0x00000001

#define _QEI1STAT_PCLEQIEN_POSITION              0x0000000A
#define _QEI1STAT_PCLEQIEN_MASK                  0x00000400
#define _QEI1STAT_PCLEQIEN_LENGTH                0x00000001

#define _QEI1STAT_PCLEQIRQ_POSITION              0x0000000B
#define _QEI1STAT_PCLEQIRQ_MASK                  0x00000800
#define _QEI1STAT_PCLEQIRQ_LENGTH                0x00000001

#define _QEI1STAT_PCHEQIEN_POSITION              0x0000000C
#define _QEI1STAT_PCHEQIEN_MASK                  0x00001000
#define _QEI1STAT_PCHEQIEN_LENGTH                0x00000001

#define _QEI1STAT_PCHEQIRQ_POSITION              0x0000000D
#define _QEI1STAT_PCHEQIRQ_MASK                  0x00002000
#define _QEI1STAT_PCHEQIRQ_LENGTH                0x00000001

#define _POS1CNT_POSCNT_POSITION                 0x00000000
#define _POS1CNT_POSCNT_MASK                     0xFFFFFFFF
#define _POS1CNT_POSCNT_LENGTH                   0x00000020

#define _POS1HLD_POSHLD_POSITION                 0x00000000
#define _POS1HLD_POSHLD_MASK                     0xFFFFFFFF
#define _POS1HLD_POSHLD_LENGTH                   0x00000020

#define _VEL1CNT_VELCNT_POSITION                 0x00000000
#define _VEL1CNT_VELCNT_MASK                     0xFFFFFFFF
#define _VEL1CNT_VELCNT_LENGTH                   0x00000020

#define _VEL1HLD_VELHLD_POSITION                 0x00000000
#define _VEL1HLD_VELHLD_MASK                     0xFFFFFFFF
#define _VEL1HLD_VELHLD_LENGTH                   0x00000020

#define _INT1TMR_INTTMR_POSITION                 0x00000000
#define _INT1TMR_INTTMR_MASK                     0xFFFFFFFF
#define _INT1TMR_INTTMR_LENGTH                   0x00000020

#define _INT1HLD_INTHLD_POSITION                 0x00000000
#define _INT1HLD_INTHLD_MASK                     0xFFFFFFFF
#define _INT1HLD_INTHLD_LENGTH                   0x00000020

#define _INDX1CNT_INDXCNT_POSITION               0x00000000
#define _INDX1CNT_INDXCNT_MASK                   0xFFFFFFFF
#define _INDX1CNT_INDXCNT_LENGTH                 0x00000020

#define _INDX1HLD_INDXHLD_POSITION               0x00000000
#define _INDX1HLD_INDXHLD_MASK                   0xFFFFFFFF
#define _INDX1HLD_INDXHLD_LENGTH                 0x00000020

#define _QEI1ICC_QEIICC_POSITION                 0x00000000
#define _QEI1ICC_QEIICC_MASK                     0xFFFFFFFF
#define _QEI1ICC_QEIICC_LENGTH                   0x00000020

#define _QEI1CMPL_QEICMPL_POSITION               0x00000000
#define _QEI1CMPL_QEICMPL_MASK                   0xFFFFFFFF
#define _QEI1CMPL_QEICMPL_LENGTH                 0x00000020

#define _QEI2CON_CCM_POSITION                    0x00000000
#define _QEI2CON_CCM_MASK                        0x00000003
#define _QEI2CON_CCM_LENGTH                      0x00000002

#define _QEI2CON_GATEN_POSITION                  0x00000002
#define _QEI2CON_GATEN_MASK                      0x00000004
#define _QEI2CON_GATEN_LENGTH                    0x00000001

#define _QEI2CON_CNTPOL_POSITION                 0x00000003
#define _QEI2CON_CNTPOL_MASK                     0x00000008
#define _QEI2CON_CNTPOL_LENGTH                   0x00000001

#define _QEI2CON_INTDIV_POSITION                 0x00000004
#define _QEI2CON_INTDIV_MASK                     0x00000070
#define _QEI2CON_INTDIV_LENGTH                   0x00000003

#define _QEI2CON_IMV_POSITION                    0x00000008
#define _QEI2CON_IMV_MASK                        0x00000300
#define _QEI2CON_IMV_LENGTH                      0x00000002

#define _QEI2CON_PIMOD_POSITION                  0x0000000A
#define _QEI2CON_PIMOD_MASK                      0x00001C00
#define _QEI2CON_PIMOD_LENGTH                    0x00000003

#define _QEI2CON_QEISIDL_POSITION                0x0000000D
#define _QEI2CON_QEISIDL_MASK                    0x00002000
#define _QEI2CON_QEISIDL_LENGTH                  0x00000001

#define _QEI2CON_QEIEN_POSITION                  0x0000000F
#define _QEI2CON_QEIEN_MASK                      0x00008000
#define _QEI2CON_QEIEN_LENGTH                    0x00000001

#define _QEI2IOC_QEA_POSITION                    0x00000000
#define _QEI2IOC_QEA_MASK                        0x00000001
#define _QEI2IOC_QEA_LENGTH                      0x00000001

#define _QEI2IOC_QEB_POSITION                    0x00000001
#define _QEI2IOC_QEB_MASK                        0x00000002
#define _QEI2IOC_QEB_LENGTH                      0x00000001

#define _QEI2IOC_INDEX_POSITION                  0x00000002
#define _QEI2IOC_INDEX_MASK                      0x00000004
#define _QEI2IOC_INDEX_LENGTH                    0x00000001

#define _QEI2IOC_HOME_POSITION                   0x00000003
#define _QEI2IOC_HOME_MASK                       0x00000008
#define _QEI2IOC_HOME_LENGTH                     0x00000001

